{"template":"/Users/suryapandian/repo/drona/drona-academy/src/containers/Service","sharedHashesByProp":{},"data":{"detail":{"category":"Blog Creation","entries":[{"image":"studyjpg","client":"Zyle Fenster Windows","link":"/blog/category/glazing-industry","order":1,"__content":"\nZyle Fenster is a great example of question to answer blog creation. This is a process of seeking out what it is that potential customers want to know about an industry, in this case the window industry. Armed with that information, we write engaging blogs to answer these questions. This will not only make for great posts throughout social media and new website content, but may also be found organically by those actively searching for your relevant products. Optically, this will give your business the impression of being at the forefront of your industry, as well as driving up your organic ranking through the flow of relevant traffic.\n"},{"image":"dr-mark-rowe-blog.jpg","client":"Dr. Mark Rowe - Blog","link":"/blog/category/self-help","order":2,"__content":"\nBetween running a medical practice and regular speaking engagements, Dr. Mark is an extremely busy man. He has a lot to say, but little time to write. To remedy this, he would provide us with notes about his ideas and initiatives. We then took these notes and reshaped them into engaging material for his followers to enjoy, and of course, to increase his visibility in the world of self-care.\n"},{"image":"incasso-blog.jpg","client":"Incasso Partners","link":"/blog/category/economics","order":3,"__content":"\nIn stark contrast to Dr. Mark, Incasso Partners, an international debt collection agency, provided zero input, but just requested blogs which provided insightful economic analysis of various jurisdictions. This is a great example of how a good blog writer can write great blogs about areas outside of their expertise through diligent research and strong writing skills.\n"}],"title":"Study Materials","thumbnail":"study.jpg","thumbnailInfo":"Photo by Aaron Burden on Unsplash","order":2,"meta":{"title":"Professional Blog Creation","description":"Highlight your industry knowledge and improve your SEO ranking with professionally written blogs"},"__content":"\nMaintaining an engaging blog has become an important aspect of many online businesses. Not only does it allow an organisation to demonstrate engagement with the development of their industry, but it also serves an important function in terms of SEO. As esoteric as Google's algorithms are, most experts agree that regularly publishing and disseminating a blog is a surefire way to improve your search ranking.\n","slug":"blog-creation","html":"<p>Maintaining an engaging blog has become an important aspect of many online businesses. Not only does it allow an organisation to demonstrate engagement with the development of their industry, but it also serves an important function in terms of SEO. As esoteric as Google&#39;s algorithms are, most experts agree that regularly publishing and disseminating a blog is a surefire way to improve your search ranking.</p>\n","path":"./content/portfolio/blog-creation"}},"path":"services/blog-creation"}
