{"template":"/Users/suryapandian/repo/drona/drona-academy/src/containers/Service","sharedHashesByProp":{},"data":{"detail":{"category":"Copy Editing","entries":[{"image":"2trust-financial.jpg","client":"2Trust Financial Management","link":"http://2trust.nl/about-us/financial-outsourcing/?lang=en","order":1,"__content":"\n2 Trust is an Amsterdam based company focused on creating accounting solutions for companies. While they had established Dutch copy for their site, they needed an English version. Using translations of the content, we were able to create and optimise an English version in order for 2 Trust to expand their business internationally.\n"},{"image":"world-fashion-apartments.jpg","client":"World Fashion Apartments","link":"https://www.worldfashionapartments.com","order":2,"__content":"\nWorld fashion Apartments is a good example of a company that just wanted to ensure the copy was optimised. They had established copy and just required us to reduce the quantity of words and ensure grammatical correctness and tonal flow throughout.\n"},{"image":"executive-mobility-group.jpg","client":"Executive Mobility Group","link":"http://www.executivemobility-group.com/","order":3,"__content":"\nExecutive Mobility Group are in the business of relocating high level executives throughout the world. As a result, it is important to communicate a high level of professionalism through the online copy. In this case the client had a clear idea of what they wanted communicated on each page, it was our job to choose the right language to do so. We are very pleased with the resulting copy.\n"}],"title":"Achivements","thumbnail":"trophies.jpg","order":4,"meta":{"title":"Professional Copy Editing","description":"Revise your existing copy and ensure it represents your business in the best possible light","photoInfo":"Photo by Ariel Besagar on Unsplash"},"__content":"\nThere are numerous reasons to revisit your existing copy and ensure it represents your business in the best possible light. Whether there are tonal issues, grammatical errors, or just too many words; WordFlow can resolve the situation quickly and more economically than writing the content from scratch. If you are in doubt, feel free to submit your content to us for a free review.\n","slug":"copy-editing","html":"<p>There are numerous reasons to revisit your existing copy and ensure it represents your business in the best possible light. Whether there are tonal issues, grammatical errors, or just too many words; WordFlow can resolve the situation quickly and more economically than writing the content from scratch. If you are in doubt, feel free to submit your content to us for a free review.</p>\n","path":"./content/portfolio/copy-editing"}},"path":"services/copy-editing"}
