{"template":"/Users/suryapandian/repo/drona/drona-academy/src/containers/Service","sharedHashesByProp":{},"data":{"detail":{"category":"Website Copy","entries":[{"image":"liadain-site.jpg","client":"Liadain Aiken Designs","link":"http://www.liadainaiken.com/","order":1,"__content":"\nLiadain’s beautiful products speak for themselves, but having gotten to know her and her business, it became clear to me that her passion for craft and her belief in sustainability were an essential part of what LA designs is about. We worked together to ensure these attributes were visible in her copy while maintaining a tone harmonious with the colourful nature of the business.\n"},{"image":"settle-service.jpg","client":"Settle Service","link":"http://settleservice.com/","order":2,"__content":"\nWith Settle Service, effective communication was paramount. It is a large detailed website with separate sections geared towards businesses and individuals. With such a large amount of information to communicate, it was essential that the voice of the organisation be established from day one. Through questionnaires and discussions, we quickly developed a professional yet accommodating tone suitable to the enterprise. We have subsequently undertaken the copy editing of an extensive manual for widespread distribution.\n"},{"image":"dr-mark-rowe-site.jpg","client":"Dr. Mark Rowe - Transformations","link":"http://www.doctormarkrowe.com/","order":3,"__content":"\nWith Dr Mark’s site, the key challenge was to find a voice commensurate with the work he is trying to do in the areas of self-help, empowerment, and self-improvement. Mark had already released a book and there was a variety of literature around his work so it was important that there was a consistency of tone throughout. We’re proud to say that we achieved this with Mark’s site and went on to write a number of blogs for the site having been provided with input from Mark. It was a challenging, yet satisfying product and we’re sure you’ll be hearing more from Dr. Mark in the future.\n"}],"title":"Courses","thumbnail":"courses.jpg","order":1,"meta":{"title":"Professional Website Copy Creation","description":"Attract and retain consumers with professionally written web copy"},"__content":"\nIn recent years it has become increasingly common for a business's first impression to be made online. As a result it is now essential to tailor your website carefully in order to communicate not only your USPs and the quality of your offering, but the character of your organisation. People often engage with businesses with an ethos they can identify with, much like they do with other people . Communicate your WHY, as well as your WHAT, and you will be on your way to building a sustainable relationship with your potential market. At WordFlow, we pride ourselves on being able to skillfully contain the essential information, the keywords, and the marketing language, in copy that truly represents the personality of your business.\n","slug":"website-copy","html":"<p>In recent years it has become increasingly common for a business&#39;s first impression to be made online. As a result it is now essential to tailor your website carefully in order to communicate not only your USPs and the quality of your offering, but the character of your organisation. People often engage with businesses with an ethos they can identify with, much like they do with other people . Communicate your WHY, as well as your WHAT, and you will be on your way to building a sustainable relationship with your potential market. At WordFlow, we pride ourselves on being able to skillfully contain the essential information, the keywords, and the marketing language, in copy that truly represents the personality of your business.</p>\n","path":"./content/portfolio/website-copy"}},"path":"services/website-copy"}
