{"template":"/Users/suryapandian/repo/drona/drona-academy/src/containers/Home","sharedHashesByProp":{},"data":{"portfolio":[{"category":"Website Copy","entries":[{"image":"liadain-site.jpg","client":"Liadain Aiken Designs","link":"http://www.liadainaiken.com/","order":1,"__content":"\nLiadain’s beautiful products speak for themselves, but having gotten to know her and her business, it became clear to me that her passion for craft and her belief in sustainability were an essential part of what LA designs is about. We worked together to ensure these attributes were visible in her copy while maintaining a tone harmonious with the colourful nature of the business.\n"},{"image":"settle-service.jpg","client":"Settle Service","link":"http://settleservice.com/","order":2,"__content":"\nWith Settle Service, effective communication was paramount. It is a large detailed website with separate sections geared towards businesses and individuals. With such a large amount of information to communicate, it was essential that the voice of the organisation be established from day one. Through questionnaires and discussions, we quickly developed a professional yet accommodating tone suitable to the enterprise. We have subsequently undertaken the copy editing of an extensive manual for widespread distribution.\n"},{"image":"dr-mark-rowe-site.jpg","client":"Dr. Mark Rowe - Transformations","link":"http://www.doctormarkrowe.com/","order":3,"__content":"\nWith Dr Mark’s site, the key challenge was to find a voice commensurate with the work he is trying to do in the areas of self-help, empowerment, and self-improvement. Mark had already released a book and there was a variety of literature around his work so it was important that there was a consistency of tone throughout. We’re proud to say that we achieved this with Mark’s site and went on to write a number of blogs for the site having been provided with input from Mark. It was a challenging, yet satisfying product and we’re sure you’ll be hearing more from Dr. Mark in the future.\n"}],"title":"Courses","thumbnail":"courses.jpg","order":1,"meta":{"title":"Professional Website Copy Creation","description":"Attract and retain consumers with professionally written web copy"},"__content":"\nIn recent years it has become increasingly common for a business's first impression to be made online. As a result it is now essential to tailor your website carefully in order to communicate not only your USPs and the quality of your offering, but the character of your organisation. People often engage with businesses with an ethos they can identify with, much like they do with other people . Communicate your WHY, as well as your WHAT, and you will be on your way to building a sustainable relationship with your potential market. At WordFlow, we pride ourselves on being able to skillfully contain the essential information, the keywords, and the marketing language, in copy that truly represents the personality of your business.\n","slug":"website-copy","html":"<p>In recent years it has become increasingly common for a business&#39;s first impression to be made online. As a result it is now essential to tailor your website carefully in order to communicate not only your USPs and the quality of your offering, but the character of your organisation. People often engage with businesses with an ethos they can identify with, much like they do with other people . Communicate your WHY, as well as your WHAT, and you will be on your way to building a sustainable relationship with your potential market. At WordFlow, we pride ourselves on being able to skillfully contain the essential information, the keywords, and the marketing language, in copy that truly represents the personality of your business.</p>\n","path":"./content/portfolio/website-copy"},{"category":"Blog Creation","entries":[{"image":"studyjpg","client":"Zyle Fenster Windows","link":"/blog/category/glazing-industry","order":1,"__content":"\nZyle Fenster is a great example of question to answer blog creation. This is a process of seeking out what it is that potential customers want to know about an industry, in this case the window industry. Armed with that information, we write engaging blogs to answer these questions. This will not only make for great posts throughout social media and new website content, but may also be found organically by those actively searching for your relevant products. Optically, this will give your business the impression of being at the forefront of your industry, as well as driving up your organic ranking through the flow of relevant traffic.\n"},{"image":"dr-mark-rowe-blog.jpg","client":"Dr. Mark Rowe - Blog","link":"/blog/category/self-help","order":2,"__content":"\nBetween running a medical practice and regular speaking engagements, Dr. Mark is an extremely busy man. He has a lot to say, but little time to write. To remedy this, he would provide us with notes about his ideas and initiatives. We then took these notes and reshaped them into engaging material for his followers to enjoy, and of course, to increase his visibility in the world of self-care.\n"},{"image":"incasso-blog.jpg","client":"Incasso Partners","link":"/blog/category/economics","order":3,"__content":"\nIn stark contrast to Dr. Mark, Incasso Partners, an international debt collection agency, provided zero input, but just requested blogs which provided insightful economic analysis of various jurisdictions. This is a great example of how a good blog writer can write great blogs about areas outside of their expertise through diligent research and strong writing skills.\n"}],"title":"Study Materials","thumbnail":"study.jpg","thumbnailInfo":"Photo by Aaron Burden on Unsplash","order":2,"meta":{"title":"Professional Blog Creation","description":"Highlight your industry knowledge and improve your SEO ranking with professionally written blogs"},"__content":"\nMaintaining an engaging blog has become an important aspect of many online businesses. Not only does it allow an organisation to demonstrate engagement with the development of their industry, but it also serves an important function in terms of SEO. As esoteric as Google's algorithms are, most experts agree that regularly publishing and disseminating a blog is a surefire way to improve your search ranking.\n","slug":"blog-creation","html":"<p>Maintaining an engaging blog has become an important aspect of many online businesses. Not only does it allow an organisation to demonstrate engagement with the development of their industry, but it also serves an important function in terms of SEO. As esoteric as Google&#39;s algorithms are, most experts agree that regularly publishing and disseminating a blog is a surefire way to improve your search ranking.</p>\n","path":"./content/portfolio/blog-creation"},{"category":"Video Scripts","entries":[{"video":"https://player.vimeo.com/video/226184927","client":"GoodToGo Media","title":"Promotional Content","__content":"\n\nGoodToGo Media are a content based site that aims to inspire, entertain, and shine a light on what is positive in the world. They sought a concept and script for a video which would illustrate this identity. We chose to contextualise their role as purveyors of positive content, in a world that exposes us to more and more of the negative. We are pleased with the clarity of message in the resulting video.\n"},{"video":"https://player.vimeo.com/video/31140382","client":"Orangina Schweppes Corporation","title":"Corporate Videos","order":1,"__content":"\n\nCorporate video scripts require a particular finesse that differs from consumer targeted promotional materials. It is about representing the company and its ethos in a way that resonates with both prospective employees as well as potential business partners. These kinds of videos must be descriptive of the status quo while also looking to the future, they should pay homage to past achievements while signalling more to come, and they should encapsulate an organisation’s motivation in a way that makes a lasting impression.\n"},{"video":"https://player.vimeo.com/video/153400223","client":"Century Office Supplies","title":"Social Media Videos","order":2,"__content":"\n\nThe script for Century Office Supplies is a great example of the short form promotional videos often use by companies to promote themselves throughout social media platforms. As is often the case for these videos, the challenge as a writer is to provide a concept that is both memorable and catchy, while also allowing for inexpensive production. These taglines and concepts should be repeatable with different visuals, as was the case for this campaign.\n"},{"video":"https://player.vimeo.com/video/193517681","client":"Kailani Ice Tea","title":"Crowdfunding Videos","order":3,"__content":"\n\nThere is a growing trend of small to medium sized enterprises seeking to crowdfund investment in order to expand their business. This provides the particular challenge of finding copy that communicates what is often large amounts of detailed information in a short amount of time. Add to this the need for it to be presented in a way that holds the viewers attention and you have a unique copy-writing challenge. In this example the bulk of our copy was translated to Spanish as Kailani decided to focus on Iberian investors.\n"}],"title":"Question Papers","thumbnail":"exam.jpg","thumbnailInfo":"Photo by Green Chameleon on Unsplash","order":3,"meta":{"title":"Effective scripting for a variety of video styles","description":"Be it corporate videos, consumer campaigns, or short viral clips; we will create a unique and engaging script to represent the essence of your business"},"__content":"\n\nThese days, more and more businesses use video to further their growth. Be it viral videos, crowd funding videos, corporate videos, or indeed advertising campaigns, we have the ability and experience to script them for you at a rate that is highly competitive, we can also recommend partners and provide advice on producing them at a cost that won't break the bank.\n","slug":"video-scripts","html":"<p>These days, more and more businesses use video to further their growth. Be it viral videos, crowd funding videos, corporate videos, or indeed advertising campaigns, we have the ability and experience to script them for you at a rate that is highly competitive, we can also recommend partners and provide advice on producing them at a cost that won&#39;t break the bank.</p>\n","path":"./content/portfolio/video-scripts"},{"category":"Copy Editing","entries":[{"image":"2trust-financial.jpg","client":"2Trust Financial Management","link":"http://2trust.nl/about-us/financial-outsourcing/?lang=en","order":1,"__content":"\n2 Trust is an Amsterdam based company focused on creating accounting solutions for companies. While they had established Dutch copy for their site, they needed an English version. Using translations of the content, we were able to create and optimise an English version in order for 2 Trust to expand their business internationally.\n"},{"image":"world-fashion-apartments.jpg","client":"World Fashion Apartments","link":"https://www.worldfashionapartments.com","order":2,"__content":"\nWorld fashion Apartments is a good example of a company that just wanted to ensure the copy was optimised. They had established copy and just required us to reduce the quantity of words and ensure grammatical correctness and tonal flow throughout.\n"},{"image":"executive-mobility-group.jpg","client":"Executive Mobility Group","link":"http://www.executivemobility-group.com/","order":3,"__content":"\nExecutive Mobility Group are in the business of relocating high level executives throughout the world. As a result, it is important to communicate a high level of professionalism through the online copy. In this case the client had a clear idea of what they wanted communicated on each page, it was our job to choose the right language to do so. We are very pleased with the resulting copy.\n"}],"title":"Achivements","thumbnail":"trophies.jpg","order":4,"meta":{"title":"Professional Copy Editing","description":"Revise your existing copy and ensure it represents your business in the best possible light","photoInfo":"Photo by Ariel Besagar on Unsplash"},"__content":"\nThere are numerous reasons to revisit your existing copy and ensure it represents your business in the best possible light. Whether there are tonal issues, grammatical errors, or just too many words; WordFlow can resolve the situation quickly and more economically than writing the content from scratch. If you are in doubt, feel free to submit your content to us for a free review.\n","slug":"copy-editing","html":"<p>There are numerous reasons to revisit your existing copy and ensure it represents your business in the best possible light. Whether there are tonal issues, grammatical errors, or just too many words; WordFlow can resolve the situation quickly and more economically than writing the content from scratch. If you are in doubt, feel free to submit your content to us for a free review.</p>\n","path":"./content/portfolio/copy-editing"},{"category":"Social Media","entries":[{"image":"zyle-fenster-social.jpg","client":"Zyle Fenster Ireland","link":"https://zylefenster.ie/","order":1,"__content":"\nAt WordFlow we provide an all-round social media service for Zyle Fenster. This means that we generate, publish, and monitor content across Facebook, Twitter, Instagram, Linkedin, Google Adwords and even Youtube. All of these links can be found on Zyle Fenster's home page. In this way we have been able to procure followers, drive potential customers to the website, and steadily increase enquiries. Linking back to the site from these various platforms also improves organic search ranking. \n"},{"image":"zyle-facebook.jpg","client":"Facebook","link":"https://www.facebook.com/ZyleFensterIreland/","order":2,"__content":"\nUtilising Facebook has become almost manditory for most businesses. The ability to target demographics based on such a broad range of criteria mean that, in the right hands, your Facebook page can be used to get your marketing content right where you want it. By creating and monitoring posts, we can build your Facebook following which in turn galvanises your position in your chosen industry. \n"},{"image":"search-results.png","client":"Google Adwords","link":"https://www.google.ie/search?q=zyle+fenster+ireland","order":3,"__content":"\nGoogle Adwords is an extremely useful tool for generating leads for any company. Many new businesses will struggle to have high organic search ranking for at least a year or two. Using Adwords means that you can simply pay for clicks, but not only this, you can test which ad does best and embark on a process of AB testing which will allow you to optimise your results, all while making sales. We see real results when performing this service for our clients.\n"}],"title":"Donate","thumbnail":"donate.jpg","thumbnailInfo":"Photo by Micheile Henderson on Unsplash","order":5,"meta":{"title":"Professional Social Media Management","description":"Save time and money by outsourcing your social media management to proven professionals who know how to target your demographic"},"__content":"\nThese days, there are not many consumer focused businesses that do not benefit from having a considered social media strategy. Not only has it become expected in terms of presence and communication. It also allows enterprises to target their demographics more specifically than ever before, as well as generating traffic to improve SEO results. We can facilitate targeted marketing as well as the generation of quality content across all platforms.\n","slug":"social-media","html":"<p>These days, there are not many consumer focused businesses that do not benefit from having a considered social media strategy. Not only has it become expected in terms of presence and communication. It also allows enterprises to target their demographics more specifically than ever before, as well as generating traffic to improve SEO results. We can facilitate targeted marketing as well as the generation of quality content across all platforms.</p>\n","path":"./content/portfolio/social-media"},{"category":"Writer For Hire","entries":[],"title":"Join Us","thumbnail":"joinUs.jpg","order":6,"heroImage":"typewriter.jpg","heroInfo":"Photo by Perry Grone on Unsplash","meta":{"title":"Professional Writer for Hire","description":"Scripts, white papers, proposals, speeches; whatever your writing need, we have the experience to deliver"},"__content":"\nWe specialise in finding the right words to meet your needs. Over the years we have found that your needs might not always fit neatly into one of our service categories. For example, we have been engaged to write copy for mobile phone apps, to re-write white papers for companies seeking investment, we have written application letters and copy edited PhD proposals, we have even helped people with speeches. The point is that we believe we can help you regardless of the nature of your communications need, which is why we created this category.\n\nThere are many of you out there achieving great things, and we know that you may not have the time, or indeed the aptitude, to produce suitable text. That’s where we come in. [Get in touch](/contact), outline what it is that you need, and we can take it from there.\n\nLet *us* worry about the words.\n","slug":"writer-for-hire","html":"<p>We specialise in finding the right words to meet your needs. Over the years we have found that your needs might not always fit neatly into one of our service categories. For example, we have been engaged to write copy for mobile phone apps, to re-write white papers for companies seeking investment, we have written application letters and copy edited PhD proposals, we have even helped people with speeches. The point is that we believe we can help you regardless of the nature of your communications need, which is why we created this category.</p>\n<p>There are many of you out there achieving great things, and we know that you may not have the time, or indeed the aptitude, to produce suitable text. That’s where we come in. <a href=\"/contact\">Get in touch</a>, outline what it is that you need, and we can take it from there.</p>\n<p>Let <em>us</em> worry about the words.</p>\n","path":"./content/portfolio/writer-for-hire"}],"quotes":[{"client":null,"order":1,"__content":"\nGive a man a fish and you feed him for a day; teach a man to fish and you feed him for a lifetime.\n","html":"<p>Give a man a fish and you feed him for a day; teach a man to fish and you feed him for a lifetime.</p>\n","summary":"<p>Give a man a fish and you feed him for a day; teach a man to fish and you feed him for a lifetime. <span class=\"summary-ellipsis\">[...]</span></p>"},{"client":"Robert Frost","order":2,"__content":"\nEveryone has a story we know nothing about\n","html":"<p>Everyone has a story we know nothing about</p>\n","summary":"<p>Everyone has a story we know nothing about <span class=\"summary-ellipsis\">[...]</span></p>"},{"client":"Ellen De Generes","order":3,"__content":"\nBe kind to one another\n","html":"<p>Be kind to one another</p>\n","summary":"<p>Be kind to one another <span class=\"summary-ellipsis\">[...]</span></p>"},{"client":null,"order":4,"__content":"\nDo your best\n","html":"<p>Do your best</p>\n","summary":"<p>Do your best <span class=\"summary-ellipsis\">[...]</span></p>"}],"testimonials":[{"author":"Irene Bunt","client":"Managing Director at Settle Service","order":2,"__content":"\nRob Power wrote a substantial amount of our website copy in 2015. He plays with words and moulds texts so that our clients understand our business extremely quickly.\n","html":"<p>Rob Power wrote a substantial amount of our website copy in 2015. He plays with words and moulds texts so that our clients understand our business extremely quickly.</p>\n","summary":"<p>Rob Power wrote a substantial amount of our website copy in 2015. He plays with words and moulds texts so that our clients understand our business extremely quickly. <span class=\"summary-ellipsis\">[...]</span></p>"},{"author":"Surya","client":"Writer","order":3,"__content":"\nWe extend our warm thanks to Valli Aunty\n","html":"<p>We extend our warm thanks to Valli Aunty</p>\n","summary":"<p>We extend our warm thanks to Valli Aunty <span class=\"summary-ellipsis\">[...]</span></p>"},{"author":"Nino Nielson","client":"Executive Mobility Group","__content":"\nRob at WordFlow undertook the copy-writing for our new website. We were greatly pleased with the professionalism, insights, and speedy delivery.\n","html":"<p>Rob at WordFlow undertook the copy-writing for our new website. We were greatly pleased with the professionalism, insights, and speedy delivery.</p>\n","summary":"<p>Rob at WordFlow undertook the copy-writing for our new website. We were greatly pleased with the professionalism, insights, and speedy delivery. <span class=\"summary-ellipsis\">[...]</span></p>"}]},"path":"/"}
