{"template":"/Users/suryapandian/repo/drona/drona-academy/src/containers/Post","sharedHashesByProp":{},"data":{"posts":[{"title":"Windows, Doors, and Sliders: How Big is Too Big?","description":null,"author":"Rob Power","category":"Glazing Industry","date":1518892200000,"image":"oversize-windows.jpg","html":"<h1 id=\"windows-doors-and-sliders-how-big-is-too-big\">Windows, Doors, and Sliders: How Big is Too Big?</h1>\n<p>As with all industries nowadays, technology marches on when it comes to the utility of glass in your home. Triple glazing is becoming more common-place, as is Alu-clad, a product which allows for greater longevity and reduced maintenance. Energy retention is increasing all the time in concert with the worlds increasing need for sustainability; making passive homes within reach for more and more people. However, as is also the case with other industries, as possibilities increase, so do customer expectations, and we are finding more and more clients seeking to maximize their views, and indeed the light in their home by installing oversize glazing. But what are the limits of today’s products? Whether it’s a fixed pane, a sash slider, or a sliding door, just how big can it be? We turned to Walter Power at Zyle Fenster Ireland to find out.</p>\n<h4 id=\"how-often-are-you-getting-questions-about-over-size-glazing-these-days\">How often are you getting questions about over-size glazing these days?</h4>\n<p>In reality, it is almost every day at this stage. It is probably a bit more common for us than other suppliers as we have earned a reputation for being able to handle some of the larger bespoke jobs. Many companies will just downright refuse to get involved in it as it is generally a more complicated process from design, fabrication, and through to installation. It suits us though as we prefer to provide a personalised service to a limited number of clients, rather than chase volume and allow our standard to drop. We receive a lot of inquiries based on the fact that we are willing to produce and install some quite astonishing glazing, sliders in particular. In fact, as I speak, we are installing a ten metre, 4 pane slider, overlooking the bay of Kinsale.</p>\n<h4 id=\"before-i-ask-about-the-specific-limits-of-glazing-types-what-kinds-of-issues-do-oversize-products-bring-up\">Before I ask about the specific limits of glazing types, what kinds of issues do oversize products bring up?</h4>\n<p>So nowadays it is not just a matter of fabricating and installing, we also must have a good understanding of the energy retention implications of any glazing that we do, so design calculations have to be made from that perspective. Additionally, our production facilities tend to be set up for what the most common needs are so some creative engineering generally needs to happen there. The real attention to detail though, comes during the installation stage. We are sometimes dealing with multiple panes of glass, each weighing up to a quarter of a ton! This takes, experience, planning, and of course specialized machinery to make happen. The heavier a product, the more essential attention to detail is when installing, we have to ensure we take the time to get everything just so in order to maximize efficiency and functionality.</p>\n<h2 id=\"size-limits\">Size Limits</h2>\n<h3 id=\"windows\">Windows</h3>\n<h4 id=\"fixed-panes\">Fixed Panes</h4>\n<p>When it comes to single fixed panes, we generally max out at about three metres by two and a half metres. This size can be reached across products by increasing the density of the glass. Realistically, however, this limit is dictated by logistics. That is, the difficulty of transporting and installing anything larger than this. In truth, if a client has pockets deep enough to pay for bespoke logistical arrangements, this size could be increased.</p>\n<h4 id=\"opening-windows\">Opening Windows</h4>\n<p>When it comes to the size of an opening sash, our Tilt &amp; Turn system provides the most durability. This is essentially why I encourage all clients to avail of this system. Not only does it give you a variety of opening positions for airing, cleaning etc. But they are also a much more robust system than opening out, even if you are not going for a large size. A single opening vent can go up to two and a half square metres, although it is not wise to have a sash that is wider than it is high. When you talk about opening out, side hung sashes, you can reduce these limits considerably. For our products we max out at about seventy centimetres wide, although I know other companies do slightly more. I would bet though, that if you have any kind of large opening out window, you will be replacing those hinges before long.  As I said, we like to focus on the best products so we tend to favour Tilt &amp; Turn jobs.</p>\n<h4 id=\"sash-windows\">Sash Windows</h4>\n<p>With sash sliding windows we have done up to one and a half metres wide by three metres high. We haven’t really had cause to work out limits yet but with engineering, they are very durable. It’s all about the counterweights you put inside the frame and I’m sure we could figure out some quite large ones if they were needed, sash window technology is quite old after all. That being said, U-value wasn’t such a factor when they were first building Georgian houses. We recently did a massive job in the UK where the sash sliders were ‘curved on plan’. This means that the actual frames and glass were curved as you would look at them from above, to match the curvature of the old building.</p>\n<h3 id=\"doors\">Doors</h3>\n<p>So for our doors, we will guarantee anything up to one point two metres wide by two and a half metres high. We can do this across our range of products. We are finding a big increase in the interest in larger front doors like this and so they are tried and tested at this size by now. When we get into our more advanced aluminium systems like Schuco, we can increase the height to three metres. When it comes to double doors, you can simply double the size of the single ones and we can build them for you.</p>\n<h3 id=\"sliders\">Sliders</h3>\n<p>When it comes to an Aluclad or Timber slider, the largest two pane slider we can do is six metres wide by two point seven metres high. Overall width can be increased by adding fixed panes but we tend to max out at about ten metres wide like the one we are currently doing in Cork (see picture) When we get into more expensive products like Schuco, we can increase the height to three metres but overall width still generally maxes out at ten, although there are some more things you can do with Schuco also (see Schuco blog <a href=\"https://www.zylefenster.co.uk/blog/the-amazing-possibilities-of-schco\">here</a>).</p>\n<p>All in all, there are limits to how big glazed products can be, whether it is down to gearing, transportation or the glass itself. However, Zyle Fenster have been found more willing than most to deal with bespoke oversize products as they are positioned for one-off high quality builds rather than mass production. Click <a href=\"https://www.zylefenster.co.uk/assets/zyle-fenster-brochure.pdf\">here</a> to download a brochure today.\n<a href=\"https://www.zylefenster.co.uk/blog/windows-doors-and-sliders-how-big-is-too-big\">https://www.zylefenster.co.uk/blog/windows-doors-and-sliders-how-big-is-too-big</a></p>\n","slug":"windows-doors-and-sliders:-how-big-is-too-big","categorySlug":"glazing-industry","summary":"<p>As with all industries nowadays, technology marches on when it comes to the utility of glass in your home. Triple glazing is becoming more common-place, as is Alu-clad, a product which allows for greater longevity and reduced maintenance. Energy retention is increasing all the time in concert with t <span class=\"summary-ellipsis\">[...]</span></p>"},{"title":"Triple Glazing, is it worth it?","description":null,"author":"Rob Power","slug":"triple-glazing-is-it-worth-it","category":"Glazing Industry","date":1517769000000,"image":"triple-glazing.jpg","html":"<h1 id=\"triple-glazing-is-it-worth-it\">Triple Glazing: Is it worth it?</h1>\n<p>Discerning consumers today have developed a somewhat wise suspicion of the incessant updating of existing products. We are told that our razors need 5 blades now, four just won’t suffice. Toothbrushes are relentlessly updated to reach the parts that your antiquated yard brush has been neglecting for years, and that’s without mentioning the calculated drip feeding of tech updates by device manufacturers. We are motivated to believe that we always need the next new thing, lest the Joneses be mocking us whilst they silently mow down our cat in their electric car! It may seem on the face of it that the window industry’s insistence that double glazing is yesterday’s news is yet another example of commercial hoodwinkery, but is it? What exactly does triple glazing bring to the table?</p>\n<h2 id=\"a-tale-of-u-values-and-g-values\">A tale of U-Values and G-Values.</h2>\n<p>Essentially the energy efficiency of windows comes down to two measureable factors. First is U-Value. This refers to the heat that is lost through any substance that makes up the shell of your home, it’s a standard applied to walls and roofs, as well as windows. Secondly we have G-Value, also known as solar gain. This refers to the amount of heat that is absorbed through the windows when the sun hits them.</p>\n<h3 id=\"u-value\">U-Value</h3>\n<p>First let’s address the case of U-Value and its significance. When double glazed windows first hit the scene, they would have had a U-Value nearing 3. Modern manufacturing techniques have resulted in ubiquitous improvement in this and today you won’t find a double glazed window with a U-Value of more than 1.6. These improvements include – </p>\n<ul>\n<li>Improved design has removed conductive bridges, such as metal frame elements.</li>\n<li>Increased cavity sizes between the glass panes </li>\n<li>Low-emissivity coatings (low-e) added to panes, reducing heat loss.</li>\n<li>Inert gas injected into cavities.</li>\n</ul>\n<p>The up-shot of all this is that these days, high quality double glazed windows can achieve a U-Value of 1.1. This is of course, a great improvement, but when you take into consideration that modern regulations demand a value of 0.3 for walls, it is obvious that windows still represent a weak point in terms of heat retention. So what difference does another pane make? Well, Zyle Fenster Ireland produce a triple-glazed window, with low-e coatings on two of the three panes which results in a U-Value of 0.55. This is clearly a great improvement when it comes to heat retention. But where does G-Value come into it?</p>\n<h3 id=\"g-value\">G-Value</h3>\n<p>G-Value, also known as solar gain, refers to the ability of the windows to absorb heat from external sunlight. As opposed to U-Value, G-Value is scored 0-1 with a higher score meaning more heat absorption. Triple glazing, through its extra thickness generally reduces this figure, leading some architects and builders to lament the loss of extra heat. Indeed the ultra-low energy PassivHaus standard requires a G-Value of no lower than 0.6 or 60%, which is achievable with triple glazing through using special glass which in turn worsens the U-Value. The question then becomes is this trade-off worth it, do we want some heat from the sunlight that hits our house, or do we want to retain the heat produced within? When I put this question to Walter Power of Zyle Fenster Ireland, he responded with the following –</p>\n<blockquote>\n<p>“Generally, in Ireland and the UK at least, I don’t think people should be too worried about G-Value… During the summer, when there is enough heat in the sun to actually benefit the temperature of your house, this is precisely the time when you don’t need it. My advice is always to go for energy retention above heat absorption”.</p>\n</blockquote>\n<h2 id=\"so-should-we-fork-out-for-it\">So should we fork out for it?</h2>\n<p>So it is clear that we can greatly improve the heat retention of our homes with triple glazing. We should of course ensure that the rest of our home is well enough insulated to make it worth it. Although often the cost differential is not that great, in some cases, while the difference can between double and triple glazing in Ireland can rise as high as 30%, Walter told us that it is only around 7% with Zyle Fenster Ireland, which would make it seem like a no-brainer, particularly for those building new modern homes. The bottom line is that double glazing can still suffice in many cases, but if you are doing a new-build, or have an otherwise well insulated home, then triple glazing is will ensure greater comfort and maybe, over time, you might save a bit on bills too. </p>\n<p>If you would like to know more about triple glazing or anything else window related, get in touch with the experts at <a href=\"http://www.zylefenster.com\">www.zylefenster.com</a></p>\n<p><a href=\"https://www.zylefenster.co.uk/blog/triple-glazing-is-it-worth-it\">https://www.zylefenster.co.uk/blog/triple-glazing-is-it-worth-it</a></p>\n","categorySlug":"glazing-industry","summary":"<p>Discerning consumers today have developed a somewhat wise suspicion of the incessant updating of existing products. We are told that our razors need 5 blades now, four just won’t suffice. Toothbrushes are relentlessly updated to reach the parts that your antiquated yard brush has been neglecting for <span class=\"summary-ellipsis\">[...]</span></p>"},{"title":"Buying Windows – How long Should My Lead Time Be?","description":null,"author":"Rob Power","slug":"buying-windows-how-long-should-my-lead-time-be","category":"Glazing Industry","date":1516213800000,"image":"lead-time-windows.jpg","html":"<h1 id=\"buying-windows--how-long-should-my-lead-time-be\">Buying Windows – How long Should My Lead Time Be?</h1>\n<h4 id=\"time-from-order-to-delivery\">Time From Order to Delivery</h4>\n<p>Currently, for Aluclad windows you might be quoted turnaround times of anything between four to twelve weeks. The truth is that eight weeks is the norm for most companies these days. The average timeline is six weeks for timber and usually can be reduced to four for PvC. So why can some companies do it so much quicker? Well generally there are one of two reasons a company will have a quick turnaround time. Firstly it might mean that they are truly a gargantuan operation and as such, can afford to have a constant stock of materials to draw from. If this is the case then it is important to be aware of other potential issues. Larger manufacturers can sometimes have so many sales reps that they lack depth in experience when recommending the right product for your requirements. Similarly there are occasional issues with the quality of fitting and indeed fulfilling the aftercare needs that might result from this. The other possibility is that they are a smaller operation just without many jobs in the offing. In either case, if you are quoted a short lead time, it is highly advisable to do some online research on the company to hear about other consumers’ experience of their service.</p>\n<h4 id=\"why-does-it-take-so-long\">Why Does It Take So Long?</h4>\n<p>Quality windows simply have a lot of processes to go through before they are ready for installation. To give you an idea, I will list some of the processes involved in fabricating Wood Frame Windows.</p>\n<p><strong>Procurement</strong>: Most manufacturers procure materials on a job to job basis.\n<strong>Cutting</strong>: Applicable materials are cut to length for each product.\n<strong>Profiling</strong>: CNC machines are used to shape the timber to its required form.\n<strong>End Dipping</strong>: Whenever timber is cut it is treated and sealed for longevity.\n<strong>Assembly</strong>: The treated and formed lengths are joined to create frames.\n<strong>Impregnation</strong>: A sealing treatment to increase timber durability and longevity.\n<strong>Middle Coat</strong>: The first application of your chosen colour.\n<strong>Finish Coat</strong>: The final coating of your selected RAL colour.\n<strong>Mechanisms</strong>: Hinges and Gearing must be added with precision.\n<strong>Glazing</strong>: Finally the glass of your choice and the external beading is added to complete the windows.\n<strong>Packaging</strong>: Of course don’t forget, the windows must be carefully packaged for safe transport.</p>\n<h4 id=\"why-does-it-matter-so-much\">Why Does It Matter So Much?</h4>\n<p>To the uninitiated, it might seem as though the lead time for window delivery shouldn’t be an issue. Doesn’t it take months to build a house anyway? Can’t they just be ordered before you start construction? While the answer to the former question is yes, the unfortunate answer to the latter is usually no. If you are building a wood-framed house, which are prefabricated with precision, you can rely on the sizing matching the plans. However, when you are building with blockwork, the majority of builders simply do not build to the plans with any kind of precision. Many of them will simply build openings to the nearest full block, refusing to even split any blocks. This means that the discrepancy between the plans and the finished openings can be considerable and by extension it means that the openings simply must be measured upon completion before any order is processed. If this is not done efficiently and at the right juncture of your build, it can cause downtime on site. Anyone who has built a house will agree that the last thing you want is your team moving on to another job because they are waiting on window installation.</p>\n<h4 id=\"how-to-pre-empt-any-delays-in-your-build\">How to Pre-empt Any Delays in Your Build</h4>\n<p>We spoke to Walter at Zyle Fenster Ireland and asked him how best to avoid any delays associated with the lead time of windows, and he gave us the following advice.</p>\n<p>“The best way to keep your build going smoothly is to ensure that you call me to measure the windows the moment the last opening is complete. This means that when I put through your order, your team can continue with constructing the entire roof while your windows are in production. If you are lucky enough to have a consistent run of good weather and complete your roof in say four or five weeks, then the finished floor can be applied to our agreed height. Following this there is always ground works to be done. The key element is planning and scheduling; when that is in place there should be little to no issue with an eight week lead in time. Essentially, it is simply worth it to have high quality windows going forward.”</p>\n<p>With this advice, it seems as though lead-in times shouldn’t cause too much of a ruckus for the organised home builder, but it is certainly beneficial to make yourselves aware of them early on and plan accordingly.</p>\n<p><a href=\"https://www.zylefenster.co.uk/blog/buying-windows-how-long-should-my-lead-time-be\">https://www.zylefenster.co.uk/blog/buying-windows-how-long-should-my-lead-time-be</a></p>\n","categorySlug":"glazing-industry","summary":"<p>Currently, for Aluclad windows you might be quoted turnaround times of anything between four to twelve weeks. The truth is that eight weeks is the norm for most companies these days. The average timeline is six weeks for timber and usually can be reduced to four for PvC. So why can some companies do <span class=\"summary-ellipsis\">[...]</span></p>"},{"title":"The Amazing possibilities of Schüco","description":null,"author":"Rob Power","category":"Glazing Industry","date":1502994600000,"image":"schuco.jpg","html":"<h1 id=\"the-amazing-possibilities-of-schüco\">The Amazing Possibilities of Schüco</h1>\n<p>Schüco (sometime Schueco) is warmly referred to by Zyle Fenster’s Walter as the ‘Rolls Royce of glazing systems’. They are a German producer of windows, doors, sliders, curtain walling and absolutely everything in between. The Schüco system is a little bit special as far as windows go and frankly, considering the kind of work they do on massive commercial and industrial projects internationally (learn more <a href=\"https://www.schueco.com/web2/uk/clients\">here</a>), it is actually somewhat surprising that they are so engaged with the residential market. The fact is that they are though, and while it is worth saying upfront that Schüco products certainly aren’t cheap, anyone investing substantially in a contemporary styled home would do well to check out what Schüco have to offer before making a call on their glazing. We sat down for a chat with the guys at Zyle Fenster, a supplier of Schüco, to hear about what makes it special. The following are just some of the ways in which Schüco stands out in the crowd.</p>\n<h3 id=\"big-and-bespoke\">Big and Bespoke</h3>\n<p>The boffins at Schüco are entirely accustomed to adapting their products to meet the needs of all kinds of large scale architectural visions throughout the world. The scale of some of the challenges they have undertaken essentially means that whatever you can throw at them in terms of your private home design, is likely to be a piece of cake to them. Their highly engineered section is designed to be adaptable to all kinds of shapes and sizes, and indeed it is commonly used in Ireland and the UK for high level glazing which can encompass a couple of floors while easily achieving the structural integrity required to handle the associated pressures. This is all achieved with high grade thermally broken aluminium meaning that it is extremely efficient in terms of energy retention, and will easily meet passive house standards where required. Any architect worth their salt will tell you that one of the most important things to consider when building is the outer shell, the skin if you like, of your home. It is this that dictates temperatures and allows your home to breath, and is of course costly to modify after the fact. There is no doubt that the Schüco system provides an unbelievably efficient and stylish example of this, but what are some of the other features that might be interesting to someone undertaking a residential build?</p>\n<h3 id=\"bringing-the-outside-in\">Bringing the Outside In</h3>\n<p>As a way of bringing in light and air, sliding glass doors are seeing a real surge in popularity, in fact Zyle Fenster rarely do a new residential build without a large slider as part of the package. The Schüco systems allows this to be taken to the next level with a range of extra possibilities. Here are just a couple of examples.</p>\n<h3 id=\"three-track-sliders\">Three Track Sliders</h3>\n<p>While some systems can accommodate three-track-sliders in a narrower section, if you want to have a large scale robust slider with three tracks, Schüco is the way to go. This means that you can have two active panels on your sliding door, essentially meaning that you can open up two thirds of your wall of glazing to the outside world. This a really desirable feature for those living rurally or with large gardens. You can bring the outside in during the day, and with Schüco, when you close it up at night you still have great U-Values, regardless of the scale, when the time comes to close it again.</p>\n<h3 id=\"cornerless-sliders\">Cornerless Sliders</h3>\n<p>Similarly popular in modern builds is having a glazed corner with a slider on one or both sides. With conventional Wood, Aluclad or uPVC systems, this would require two external sections to meet at the corner and a piece of cladding to complete the finish. The Schüco system allows you to have two sliding doors meet in a corner and when opened, have no upright support there whatsoever. This is a beautiful feature when leading out onto a deck or a garden and many Zyle Fenster customers have opted for Schüco precisely with this feature in mind.</p>\n<h3 id=\"stylings\">Stylings</h3>\n<p>For contemporary styled building, Schüco always appeals. Its sleek design incorporates features as standard that are pricey add-ons with other systems. Features such as flush glazing, which means that even sashes with a full range of tilt and turn movement are completely flush with the outer frame when closed. Or concealed hinges, an expensive feature with other systems, are a matter of course for Schüco. The removal of visible hinging is very popular among the design conscious and in terms of practicality it offers increased protection from the elements for the all-important moving parts of the system. Ultimately, while there are reasons why a client wouldn’t chose Schüco, financial or otherwise, style itself is very unlikely to be one of them.</p>\n<p>If you would like a quote or advice regarding building with Schüco, feel free to contact us <a href=\"https://www.zylefenster.co.uk/contact-us\">here</a>.</p>\n<p>If you would like to learn more about the Schüco Slider system, click <a href=\"https://www.zylefenster.co.uk/products/sliding-doors/schuco-aluminium\">here</a>.</p>\n<p><a href=\"https://www.zylefenster.co.uk/blog/the-amazing-possibilities-of-schco\">https://www.zylefenster.co.uk/blog/the-amazing-possibilities-of-schco</a></p>\n","slug":"the-amazing-possibilities-of-schuco","categorySlug":"glazing-industry","summary":"<p>Schüco (sometime Schueco) is warmly referred to by Zyle Fenster’s Walter as the ‘Rolls Royce of glazing systems’. They are a German producer of windows, doors, sliders, curtain walling and absolutely everything in between. The Schüco system is a little bit special as far as windows go and frankly, c <span class=\"summary-ellipsis\">[...]</span></p>"},{"title":"Explainer: 10 Terms to Understand When Buying Windows","description":null,"author":"Rob Power","category":"Glazing Industry","date":1500316200000,"image":"10-terms-windows.jpg","html":"<h1 id=\"explainer-10-terms-to-understand-when-buying-windows\">Explainer: 10 Terms to Understand When Buying Windows</h1>\n<p>Buying windows can be a tricky process and it is worth being as well informed as possible before making your decision. After all, if you make the right choice, they could be with you for a lifetime. Here are some important terms explained so you can embark on your window buying journey armed with some useful industry knowledge. Take our advice and good luck with an altogether different kind of window-shopping!</p>\n<h4 id=\"1-alu-clad\">1. ALU CLAD</h4>\n<p>The phrase ‘Alu Clad’ is used to describe windows (or patio doors for that matter) where the frame is made of solid wood with Aluminium attached to the external face of the frame. The cladding acts like a protective skin, offering protection and breathability, greatly reducing maintenance while increasing longevity.</p>\n<h4 id=\"2-passive-house--passivhaus\">2. PASSIVE HOUSE / PASSIVHAUS</h4>\n<p>A Passive House is essentially a building specifically engineered to be highly energy efficient. High specification building materials, glazing, and ventilation systems are utilised to control the heat and airflow throughout the building. There are recognised standards developed in order to facilitate the design of such buildings with the most internationally recognised being the Passivhaus standard, developed in Germany.</p>\n<h4 id=\"3-u-value\">3. U-VALUE</h4>\n<p>U-Value is a term that you will hear frequently used by architects, builders and engineers alike. It refers to the heat that is lost through any substance that makes up the shell of your home, it’s a standard applied to walls and roofs, as well as windows, doors and other openings. The lower the U-Value, the better the heat retention.</p>\n<h4 id=\"4-g-value\">4. G-VALUE</h4>\n<p>G-value, also known as solar gain, is also a term regularly used by those in the business of designing and constructing buildings. It refers to the amount of heat that is absorbed through the windows when the sun hits them. The balance between this and U-Value is often a consideration because often as U-Value is improves, solar gain is decreased.</p>\n<h4 id=\"5-low-e-glass\">5. LOW-E GLASS</h4>\n<p>Low-E, or low emissivity coatings are utilised in glazing to reduce the loss of interior heat through windows. Glass by nature, has quite high emissivity, as anyone who has ever put their face against a window in winter-time will know. By applying low-e coatings to one or two panes of a triple glazed window (always two in the case of Zyle Fenster windows!), the U-Value of the windows can be considerably improved.</p>\n<h4 id=\"6-pas-24\">6. PAS 24</h4>\n<p>PAS 24 refers to an industry standard for windows and doors security based in the UK. In order to achieve PAS 24 status, products are subject to rigorous testing. All Zyle Fenster Contemporary Doors meet the requirements. Check out some of the testing here.</p>\n<h4 id=\"7-pascals\">7. PASCALS</h4>\n<p>Pascals are the units in which pressure or stress on structures are measures. This can be an important consideration when buying windows or doors, particularly if you intend to build a home in coastal, mountainous regions. Somewhat counter-intuitively, it is also important to have glazing with high pascal ratings when building in cities with tall buildings, as tall structures can channel winds in such a way that can cause extreme pressure on glazing.</p>\n<h4 id=\"8-ral-colour-chart\">8. RAL COLOUR CHART</h4>\n<p>The RAL colour chart is a colour designation system used in many areas of construction and industrial design. For the purposes of colour selection of windows and doors, there are over 200 colours to choose from. It is wise to view a physical colour chart or sample when making a decision because images you see online or elsewhere will often not show the true colour of the RAL number.</p>\n<h4 id=\"9-toughened--laminated-glass\">9. TOUGHENED / LAMINATED GLASS</h4>\n<p>Both toughened and laminated glass are products that, although different, are created to serve the same two primary functions. Firstly, they are more difficult to break. In the case of toughened glass this is achieved through thermal and chemical treatments, while in the case of laminated glass, its strength is achieved through having two or more panes sealed together with either polyvinyl butyral (PVB) or ethylene-vinyl acetate (EVA). In addition to both processes creating a more robust glass, the resultant glass is safer in the case that it does break. In the case of toughened, its treatment means that it shatters into tiny pieces rather than large dangerous shards. In the case of laminated glass, the interior coating holds the glass together when it does break so that there is little loose glass to cause injury.</p>\n<h4 id=\"10-bonus-advice-installation-and-aftercare\">10. BONUS ADVICE: INSTALLATION AND AFTERCARE</h4>\n<p>There are many good window systems on the market today which will score reasonably well on some of the above criteria. However, it is important to understand that the product itself is not the only consideration when deciding on a window company to work with. It is essential that windows and doors are installed to an exacting standard to ensure years of high performance. Additionally, fluctuating weather conditions often cause products to change position slightly in the first year following installation as the engineered products settle. This may cause some water or air leakage but is nearly always solvable with some expert adjustment. Our advice is do your homework, ask around and read forums to ensure that the company you go with cares as much about you during installation and after-service, as they do at the point of sale.</p>\n<p>If you have any more queries about the right product to buy, please feel free to get in touch with us at <a href=\"mailto:info@zylefenster.ie\">info@zylefenster.ie</a></p>\n<p><a href=\"https://www.zylefenster.co.uk/blog/explainer-10-terms-to-understand-when-buying-windows\">https://www.zylefenster.co.uk/blog/explainer-10-terms-to-understand-when-buying-windows</a></p>\n","slug":"explainer:-10-terms-to-understand-when-buying-windows","categorySlug":"glazing-industry","summary":"<p>Buying windows can be a tricky process and it is worth being as well informed as possible before making your decision. After all, if you make the right choice, they could be with you for a lifetime. Here are some important terms explained so you can embark on your window buying journey armed with so <span class=\"summary-ellipsis\">[...]</span></p>"},{"title":"Five Questions People Ask When Buying Windows","description":null,"author":"Rob Power","category":"Glazing Industry","date":1497897000000,"image":"5-questions-windows.jpg","html":"<h1 id=\"5-questions-people-often-ask-when-buying-windows\">5 Questions People Often Ask When Buying Windows</h1>\n<p>Coming into the summer is a time when many people’s new homes are under construction, or indeed many existing homeowners begin to consider how they can upgrade their glazing before the upcoming winter. Although it is a busy season, Paul at Zyle Fenster UK found the time to sit down with us to talk about some of the most common questions he gets from new customers.</p>\n<h3 id=\"whats-the-best-finish-to-choose-that-will-look-good-both-inside-and-outside\">What’s the best finish to choose that will look good both inside and outside?</h3>\n<p>Thankfully, choosing one colour for your windows that should look good both inside and outside of your home is a thing of the past. Modern finishing techniques allow customers to choose separate finishes for the interior and exterior of their windows allowing for greater freedom of design throughout the home. If you are buying wooden, or Alu Clad windows, then you have over 230 RAL colours at your disposal. When being applied to wood the timber is first protected through a process of impregnation, followed by a base coat, and finished with a lacquer which locks the colour in and creates a surface that is as easily wiped clean as your kitchen table. Of course when dealing with wood, you also have the option of purely lacquer finishes without a colour, which just bring out the character of the wood itself. Aluminium is treated differently as the colour is applied through powder coating techniques. So regardless of the product you go for, you will have the ideal colour to suit the design of both the interior and exterior of your home, and with a robust durable finish that will remain vivid for years after installation.</p>\n<h3 id=\"should-i-go-for-double-or-triple-glazing\">Should I go for double or triple glazing?</h3>\n<p>These days, there are great insulation gains to be had by choosing triple over double-glazing. Modern techniques have really added value to coughing up for the extra pane throughout your home. You should probably ensure your home is otherwise well insulated in order to make fortifying it with well insulated glazing worth your while, but if this is the case or you are undertaking a new build, Triple glazing is generally worth the extra cost within reason. While some companies might charge up to 30% more, at Zyle Fenster it generally costs only around an extra 7% making triple glazing a no-brainer for most of our customers.</p>\n<h3 id=\"what-kind-of-timber-should-i-choose\">What Kind of Timber Should I Choose?</h3>\n<p>There is no doubt that cost will be a factor when you are choosing what kind of wood is best for your needs, but there are also other variables worth taking into consideration. If you are opting for Alu Clad, which has been steadily growing in popularity in recent years, the protective layer provided by the cladding means that a soft wood such as Pine or Larch will be sufficient for your needs and indeed remain in great condition for many decades to come. On the other hand, if you are going for a purely timber frame, it could be wiser to opt for a hardwood such as Oak or Meranti, both of which have great durability and longevity. Of course if your pockets are slightly deeper, you may even want to consider having windows made from Accoya, a modern product which is the result of putting soft, sustainable woods through a process called acetylation. This timber is incredibly strong and durable, but does have a price tag to match its incredible performance.</p>\n<h3 id=\"what-kinds-of-openings-should-i-go-for\">What kinds of openings should I go for?</h3>\n<p>So when it comes to opening windows, the three main choices you have are Flush Casement Opening Out, Tilt &amp; Turn, and Sash Sliders. Of course taste should and will always be a factor when making this decision, although there are often other motivating factors. For example Tilt &amp; Turn windows, which open in, can accommodate a larger opening sash than a Flush Casement window and their dual opening style is also very useful for airing your home without having a window fully open. On the other hand, many people will favour Flush Casement opening out if space is limited in their home and they would prefer that the sashes did not open into the rooms. Similarly people sometimes favour Sash Sliders for this reason, or because they have a more traditional look. Essentially, your opening will be a matter of taste, although it is wise to speak to speak to an expert when making the decision to have the clearest picture of the implications.</p>\n<h3 id=\"how-many-of-my-windows-need-to-open\">How many of my windows need to open?</h3>\n<p>If your home doesn’t have a modern heat recovery system, which will also provide adequate ventilation, then regulations state that there should be an opening equal to one twentieth of the floor area in each room. This is usually easily covered by one substantial window, or a couple of small ones in the average room. Of course more sizable properties will have to increase their opening sizes as a result. It is good information to have as savings can be made when buying fixed panes and depending on circumstances, many opening windows see little use.</p>\n<p>If you would like to know more about our products, please click <a href=\"http://www.zylefenster.co.uk/products\">here</a>, or email <a href=\"mailto:info@zylefenster.ie\">info@zylefenster.ie</a>\n<a href=\"https://www.zylefenster.co.uk/blog/5-questions-people-often-ask-when-buying-windows\">https://www.zylefenster.co.uk/blog/5-questions-people-often-ask-when-buying-windows</a></p>\n","slug":"five-questions-people-ask-when-buying-windows","categorySlug":"glazing-industry","summary":"<p>Coming into the summer is a time when many people’s new homes are under construction, or indeed many existing homeowners begin to consider how they can upgrade their glazing before the upcoming winter. Although it is a busy season, Paul at Zyle Fenster UK found the time to sit down with us to talk a <span class=\"summary-ellipsis\">[...]</span></p>"},{"title":"Alu Clad: What it is and Why you Want it","description":null,"author":"Rob Power","slug":"alu-clad:-what-it-is-and-why-you-want-it","category":"Glazing Industry","date":1496082600000,"image":"alu-clad.jpg","html":"<h1 id=\"alu-clad-what-it-is-and-why-you-want-it\">Alu-Clad: What it is and Why You Want it</h1>\n<p>Since Alu Clad windows have hit the scene a number of years ago, they have been growing steadily in popularity, and for good reason, which we will get into later. It is hardly surprising that it was a system born in the harsh conditions of Scandinavia, where necessity is the mother of invention when it comes to optimising all the elements of building design. Alu Clad windows represent an inevitable evolution in window design that skilfully harmonises modern technology and traditional materials, while never losing site of the importance of stylish design. But what exactly are Alu Clad windows?</p>\n<h3 id=\"the-what\">The What?</h3>\n<p>With typical Scandinavian ingenuity, the inventors of Alu Clad windows took their inspiration from nature when seeking to design a way to have near maintenance free wood-framed windows. What they found was that in nature, wood manages to survive for hundreds of years without rotting or suffering the kind of degradation that it does when used as a material for building windows. Of course this is partially due to the fact that it is still alive and growing, but it also down to its bark, which robustly protects it from the elements. Inspired by this, aluminium profile was engineered to be secured directly to the front of the wooden elements of windows and doors, essentially acting as bark, albeit bark that can be powder-coated in your colour of choice! So, is this the product for you?</p>\n<h3 id=\"the-why\">The Why?</h3>\n<p>Maintenance\nThe lack of necessary maintenance is a massive factor for many customers who choose to go with Alu clad. The exterior of the wood is protected by powder-coated aluminium. This is a truly robust finish, which you would need to repaint about as often as you would need to repaint a new car. For the majority of exposed areas, this standard coat is likely to look perfect well into its second decade, however, if you are lucky enough to live right on the Atlantic coast, there is always the option of marine coating the Aluminium to guarantee protection.</p>\n<h4 id=\"longevity\">Longevity</h4>\n<p>Due to the protection, and the breathability, offered by the aluminium cladding, you can expect whatever kind of wood you choose to perform better over its lifetime than it would without it. Wood frames can sometimes need treatment over the years as the elements take their toll. Alu Clad frames on the other hand, failing a natural disaster, are very likely to last a lifetime.</p>\n<h4 id=\"style\">Style</h4>\n<p>When it comes to Alu Clad, form certainly does not suffer on account of the superior function. In addition to the sleek powder-coated aluminium on the outside, you can choose the wood of your choice to suit your interior. Options include Meranti, Oak, Pine, larch, and even Eucalyptus, all of which can also be finished to your taste. There really is no style that can’t be complimented by the right choice of Alu Clad windows, even a more traditional, stone fronted home (see picture) can benefit from the advantages that Alu Clad windows have to offer.</p>\n<h2 id=\"the-verdict\">The Verdict</h2>\n<p>There will always be some buildings that call for purely, aluminium, wood, or even uPVC windows. Having said that, it seems undeniable the Alu Clad windows truly gives you the durability promised by aluminium while also having the classic interior styling that can only be found with wood. When you add to this that Alu Clad windows can be energy rated all the way down to passive, they become an extremely attractive prospect. Our advice is, if you are in the market for windows and doors, the wise move is to at least consider Alu Clad.</p>\n<p>For more information on our products, feel free to click here, or contact us on <a href=\"mailto:info@zylefenster.ie\">info@zylefenster.ie</a></p>\n<p><a href=\"https://www.zylefenster.co.uk/blog/alu-clad-what-it-is-and-why-you-want-it\">https://www.zylefenster.co.uk/blog/alu-clad-what-it-is-and-why-you-want-it</a></p>\n","categorySlug":"glazing-industry","summary":"<p>Since Alu Clad windows have hit the scene a number of years ago, they have been growing steadily in popularity, and for good reason, which we will get into later. It is hardly surprising that it was a system born in the harsh conditions of Scandinavia, where necessity is the mother of invention when <span class=\"summary-ellipsis\">[...]</span></p>"},{"title":"The New Wonder Wood for Windows","description":"Written For Zyle Fenster Ireland","author":"Rob Power","category":"Glazing Industry","date":1494873000000,"image":"accoya.jpg","html":"<h1 id=\"accoya\">Accoya</h1>\n<h2 id=\"the-new-wonder-wood-for-windows\">The New Wonder Wood for Windows</h2>\n<p>Modern joinery techniques have greatly improved the quality and affordability of wood framed windows. While PVC is still popular, and indeed has improved in its own right, the love affair with it that was prevalent in nineties and noughties has given way to a resurgence in appreciation for the look and feel of wood. Hardwoods like Meranti, Oak, and Sapele have proven themselves to be durable enough to provide a lifetime’s satisfactory glazing in most climates. The onset of aluminium cladding has meant that even softwoods such as pine or larch can provide great structural integrity and interior styling with the benefit of exterior protection.</p>\n<p>There is, however, a new player in the world of window materials, and that is the highly performing accoya wood. This wood can rival Aluminium cladded windows for durability in all conditions, but how does it do it and what are the benefits?</p>\n<h3 id=\"what-exactly-is-accoya-wood\">What exactly is accoya wood?</h3>\n<p>Accoya is the result of putting soft, sustainable woods through a process called acetylation. Put simply, this is a process which alters the molecular structure of the woods while not introducing anything to the wood that doesn’t naturally occur. This results in a vastly more durable wood ready for application to suitable products.</p>\n<h3 id=\"what-are-the-benefits\">What are the benefits?</h3>\n<h4 id=\"increased-stability\">Increased Stability</h4>\n<p>One common issue with wooden windows and doors is that in some climates, they can be prone to expansion and contraction, which in turn can result in warping, splitting and of course functional issues. During the aforementioned process, the ability of accoya wood to absorb moisture is reduced by 80%, greatly improving stability and ensuring windows and doors that open smoothly all year round. In fact, this stability results in a longer life for the coatings which are applied to accoya, an additional maintenance reducing bonus!</p>\n<h4 id=\"immense-durability\">Immense Durability</h4>\n<p>Accoya scores a maximum 1 for durability, surpassing the score of even teak. It has been described as virtually rot proof, and assigned a 70 year minimum service life stated by TRADA. Because of its altered structure, fungi does not recognise it as a target and it is indigestible to wood invading insects rendering it immune to both.</p>\n<h4 id=\"sustainability\">Sustainability</h4>\n<p>In reality, the technology to produce accoya has been around for decades but it’s only in recent years with improved methodologies and a greater focus on sustainability that it is coming to the forefront. It is made from certified naturally renewable woods. Indeed its eco-friendliness goes beyond its life as it is fully reusable and recyclable in contrast to many other treated woods which use a variety of harmful chemical compounds.</p>\n<h2 id=\"the-verdict\">The Verdict</h2>\n<p>Accoya is certainly more expensive than other woods in terms of window and door production, but for those whose budget can reach it, it provides a unique opportunity to use a wood that is both beautiful and extremely durable. There are many climates and locations where a homeowner would, in the past, be limited to using PVC or Alu-clad windows in order to get a reasonable lifespan from their products. Accoya represents an opportunity to have both the beauty of an exterior wood finish, while still maintaining the durability of an aluminium cladding. Our advice would be, if you can afford it, it is certainly economic in the long term.</p>\n<p>To find out more about Accoya windows and many other products, feel free to visit zylefenster.ie</p>\n<p><a href=\"https://www.zylefenster.co.uk/blog/accoya-blog\">https://www.zylefenster.co.uk/blog/accoya-blog</a></p>\n","slug":"the-new-wonder-wood-for-windows","categorySlug":"glazing-industry","summary":"<p>Modern joinery techniques have greatly improved the quality and affordability of wood framed windows. While PVC is still popular, and indeed has improved in its own right, the love affair with it that was prevalent in nineties and noughties has given way to a resurgence in appreciation for the look  <span class=\"summary-ellipsis\">[...]</span></p>"},{"title":"Passive House Builds","description":null,"author":"Rob Power","category":"Glazing Industry","date":1493663400000,"image":"passive-house-builds.jpg","html":"<h1 id=\"passive-house-builds-what-they-are-and-why-they-might-be-the-future\">Passive House Builds: What they are and why they might be the future.</h1>\n<p>Whether you’re involved in the building industry, you’ve got a passing interest in building your own home, or you’re just a fan of Grand Designs; it is very likely that you have heard the phrase ‘Passive House’. The ubiquity of the term is down to the steady growth of the popularity of the building practice internationally, and the chances are, if there isn’t a passive house near you already, there will be soon. But what exactly is it? What are the benefits? And is it something you should consider for your own building project?</p>\n<h2 id=\"what-is-a-passive-house\">What is a Passive House?</h2>\n<p>A Passive House is essentially a building specifically engineered to be energy efficient. High specification building materials, glazing, and ventilation systems are utilised to control the heat and airflow throughout the building. There are recognised standards developed in order to facilitate the design of such buildings with the most internationally recognised being the Passivhaus standard, developed in Germany. There are very specific requirements that must be met to have a building certified as Passivhaus, the specific details of which I won’t include here, as the measurements would be meaningless to the lay man, however the main areas in play are heating demand, cooling demand, energy consumption, and air leakage. Naturally, building to a rigorous standard with such high specifications is not gentle on the wallet, but are there associated savings? And what are the benefits when the job is done?</p>\n<h2 id=\"for-the-conscious-consumer\">For the Conscious Consumer</h2>\n<p>While there are certain factually challenged word leaders who don’t seem to recognise the devastating realities of global warming, most rational people have some awareness and at least a little concern about the effects our carbon emissions are having on the planet. A 2003 German study found that passive houses use 90% less energy than conventional homes and as much as 80% less than homes built to Germany’s already stringent low energy construction standards. Of course the effects of any one individual building a passive home are negligible to the environment, but it still stands as a benefit to the ecologically aware. Additionally, it is not just homes that can be built to this standard, there have been schools and university buildings constructed to this standard internationally. Indeed buildings can be retrofitted to meet Passivhaus standards thanks to the improvement in the construction practices of quality windows and doors.</p>\n<h2 id=\"the-financials\">The Financials</h2>\n<p>So naturally, the initial expense of building to Passivhaus standards are generally going to be greater than that of building a conventional home. However, it is worth mentioning that some of this added expense will be offset even in the construction stages. First of all, many passive builds require far less infrastructure for heating and cooling throughout so there is a saving to be found there. Additionally, the vast majority of jurisdictions are motivated to support the construction of such properties so it is almost certain that your government provides, incentives, rebates, and/or tax credits. The combination of these two factors already increase the attractiveness of this kind of build, but when you add the ongoing savings it makes it a prospect that anyone embarking on a new build should at least consider. Essentially, the efficiency of a passive home means that utility bills are vastly reduced, a financial factor that really stacks up over the years. Combine this with the fact that the quality of materials involved ensures maximum durability for years to come, and it starts feeling like a false economy to go for the cheaper build initially.</p>\n<h2 id=\"the-cosy-factor\">The Cosy Factor</h2>\n<p>If you live in a passive build you are never going to hear someone complain about a draft. Across a variety of climates, passive builds manage the air temperature throughout the seasons to ensure optimum comfort at all times. On top of this the ventilation systems do an incredible job of circulation, drawing air from kitchens, bathrooms, and any other moisture-rich or odour-prone areas and piping fresh air throughout the living spaces. These ventilation systems also maintain humidity at a comfortable thirty to sixty percent. So no cold spots, no drafts, and no cold mornings waiting for the heating to kick in. These are benefits certainly not to be sneezed at. On top of this, noise pollution is greatly reduced due to the quality of your windows, so the outside disturbances stay right there, and indeed if your Christmas party is getting a little noisy, nobody is likely to notice! Of course you can open windows on passive homes just like any other, to adjust the temperature, let in air, or hear the world. However, these homes function so well, that most people just choose not to.</p>\n<h2 id=\"should-you-build-one\">Should You Build One?</h2>\n<p>Although it varies from country to country, construction costs are said to be around 10% more than that of a conventional build, although this is dependent on the availability of materials and professionals in your area. Indeed there have been passive builds which have come in under the cost of a similar conventional product. Either way the ongoing savings, durability, and unparalleled level of comfort means that, if you are considering a new build, you would be doing yourself a disservice not to at least look into your options when it comes to developing a build to Passivhaus standards. In an upcoming blog, we will profile one of the first passive builds completed in South East Ireland in  Zyle Fenster played a major role in guiding the client and providing the ideal products to meet the specifications required.</p>\n<p>To learn more about this and other Zyle Fenster UK Products, please feel free to browse through our range <a href=\"http://www.zylefenster.co.uk/products\">here</a>.</p>\n<p><a href=\"https://www.zylefenster.co.uk/blog/passive-house-builds-what-they-are-and-why-they-might-be-the-future\">https://www.zylefenster.co.uk/blog/passive-house-builds-what-they-are-and-why-they-might-be-the-future</a></p>\n","slug":"passive-house-builds","categorySlug":"glazing-industry","summary":"<p>Whether you’re involved in the building industry, you’ve got a passing interest in building your own home, or you’re just a fan of Grand Designs; it is very likely that you have heard the phrase ‘Passive House’. The ubiquity of the term is down to the steady growth of the popularity of the building  <span class=\"summary-ellipsis\">[...]</span></p>"},{"title":"Never Say Die! A Blog on the Power of Resilience","description":"Written for Dr. Marke Rowe","author":"Rob Power","category":"Self Help","date":1474223400000,"image":"dawn-yoga.jpg","imageCredit":"Photo by Dave Contreras on Unsplash","html":"<h1 id=\"never-say-die\">Never Say Die!</h1>\n<h2 id=\"a-blog-on-the-power-or-resilience\">A Blog on the Power or Resilience</h2>\n<p>Our ability to maintain momentum in the face of adversity is such an important factor in ensuring that we get the most out of life. The vigour of our resilience can often be the difference between achieving a goal, or falling at the hurdles that we meet along the way. However, it is vital to recognise that we do not have a static amount of resilience; just like knowledge or fitness, resilience is a skill that can be learned, developed, and nurtured in order to greatly benefit our lives.</p>\n<blockquote>\n<p>Our initial reaction to stress is so important, as it can really be the difference between overcoming or succumbing to adversity; maintaining a base line of positivity can make all the difference.</p>\n</blockquote>\n<p>The word resilient stems from the Latin ‘resilio’, meaning to bounce back from adversity. The health of our resilience impacts our ability to cope with setbacks, our ability to let go of past events, and crucially, our ability to maintain realistic optimism. Maintaining realistic optimism is so vitally important to all of life’s endeavours, because without it, we can so easily fall into self-fulfilling our own negative perspectives on the future. Anyone who has had the experience of triumphing against adversity will understand just how life affirming this experience can be. These experiences can feed our resilience through the understanding that we become stronger and wiser through overcoming obstacles. It allows us to view ourselves as unstoppable, which of course, we all have the potential to be!</p>\n<p>Resilient people are recognisable for their grit and determination, an outlook that acknowledges that challenges lay ahead but rather than fearing them, welcomes them and the growth that will surely accompany them. They are inclined to think ahead, display characteristic of optimism and positivity, and a refusal to capitulate to external pressures. This positive outlook is at the very core of resilience as it allows the individual to frame adversity in the right way, as and when it presents itself. Our initial reaction to stress is so important, as it can really be the difference between overcoming or succumbing to adversity; maintaining a base line of positivity can make all the difference. One important factor in doing this is how we perceive our daily life, and for most of us, it means how we perceive our job.</p>\n<h2 id=\"maintaining-positivity-in-the-workplace\">Maintaining Positivity in the Workplace</h2>\n<blockquote>\n<p>‘Before Enlightenment, chop wood, carry water. After Enlightenment, chop wood, carry water’</p>\n</blockquote>\n<p>The above quote stems from Buddhist teachings and the meaning it is essentially trying to convey is that the key to happiness lies not with changing your daily tasks, but with changing your perception of them. \nYale University has carried out some fascinating research in recent years which has shed some light on job satisfaction. The findings suggest that it is not necessarily our job that dictates our feeling of wellbeing, but rather how we perceive our job. They found that there are three dominant ways in which we categorise our employment, viewing it either as a job, a career, or a vocation. The results found that about one third of people fall into each category, with the results dispersed across all job types. The categories break own as follows:</p>\n<h3 id=\"a-job\">A Job</h3>\n<p>Individuals who view their work simply as a job tend to perceive it as a means to an end. The pay-check is their only motivation and as a result it can engender great dissatisfaction and disillusionment with the day-to-day routine. None of us want to wish our lives away, but viewing our employment in this way leads to people counting the hours until the day’s end, and counting the days until the weekend. This greatly limits our ability to experience contentment on a daily basis and promote negativity throughout all aspects of our lives.</p>\n<h3 id=\"a-career\">A Career</h3>\n<p>When we see our work as a career, while we still may not take great joy in our day-to-day tasks, we can benefit from a more personal investment in our work. This is because it allows us to be future oriented and strive for progress in prestige, power, and position. This outlook is hard to maintain if one’s employment does not seem to allow for progress, however, and so it can be a viewpoint that ceases to function once opportunities for progress have been exhausted.</p>\n<h3 id=\"a-calling\">A Calling</h3>\n<p>If you are lucky enough to see your work as a calling, then you are motivated to do the work for its own sake. You enjoy your work, and can actively view it in relation to its position within society. Your investment in your work means that you enjoy far greater job satisfaction, you are not inclined to watch the clock and are happy to work long hours to achieve what it is you set out to do. Those who view their work as a calling do not have to endure the daily negative feelings about going to work in the way that others do. This affords them a greater level of positivity which reverberates through all aspects of their lives, engendering resilience.</p>\n<h2 id=\"change-your-perception\">Change Your Perception</h2>\n<p>As counter intuitive as it might sound, it is not the job that dictates how we feel about it, but rather it is the meaning which we assign to it. The research has found that there are Doctors who see their work as a job, and street cleaners that see their work as a calling. Humans are adept at creating meaning for ourselves, and we are so often dictated by it. However, we can control this meaning creation by choosing to change our perspective. Consider how your work fits into society, how it is necessary and part of a larger picture. Try to be less focussed on the financial rewards and more aware of how you use your skills and experience to optimise your performance. There is always a better way to do everything, and those who seek to do whatever they do well, will benefit from a more positive relationship with their employment. By improving our outlook about our job, we can greatly reduce the amount of negativity that pervades our lives. This can be a game changer for our physical and emotional well-being, as well as actively benefitting our resilience.</p>\n<p>Just as our resilience can benefit from improving our perspective on our work, the opposite is also true. Here are some tips on improving resilience through self-care and beginning a cycle of positivity with some easy life adjustments.</p>\n<h2 id=\"five-ways-to-build-resilience\">Five Ways to Build Resilience</h2>\n<p><strong>Down Time:</strong>  It is vital to take a moment every day to switch off, relax, and re-charge. Even if this can only be five minutes, it can be hugely beneficial.\nIn Time: This refers to time for reflection and finding calm. For some people this can mean journaling, for others meditation. It is important to find what works for you, and to reflect upon your day.\n<strong>Move Time:</strong> Exercise is the magic bullet. Regular exercise will simply never fail to improve your physical and psychological well-being, as well as fortifying your resilience.\nNight Time: It can be difficult at times but it is imperative that we ensure that we get enough good quality, restorative sleep. When we do not, it diminishes our energy levels and by extension, greatly reduces our resilience.\n<strong>Play Time:</strong> We can’t neglect our social lives, it is an important part of our emotional health. Make sure you find the time to laugh and enjoy life with friends. It is a cathartic relief that gives perspective to our struggles.</p>\n<p>Resilience is all about positivity. We must try to actively bring positivity into our lives as it becomes a resource, a well from which we can draw strength in times of need. We must absorb all we can from the good things in our lives. We must have gratitude for all that we have, and reduce our awareness of what we lack. By stopping and smelling the roses, pausing to enjoy your favourite song, or taking the time to sit in a beautiful place, we can actually provide ourselves with the fuel we need to overcome adversity. Find the positivity in your world today, I assure you it’s there, you just have to look for it!</p>\n<p>Be sure to follow Dr Mark on Twitter and check out doctormarkrowe.com for ongoing advice on getting the most out of life!</p>\n","slug":"never-say-die!-a-blog-on-the-power-of-resilience","categorySlug":"self-help","summary":"<p>Our ability to maintain momentum in the face of adversity is such an important factor in ensuring that we get the most out of life. The vigour of our resilience can often be the difference between achieving a goal, or falling at the hurdles that we meet along the way. However, it is vital to recogni <span class=\"summary-ellipsis\">[...]</span></p>"},{"title":"The Path of Forgiveness","description":"Written for Dr. Marke Rowe","author":"Rob Power","category":"Self Help","date":1471458600000,"image":"serenity.jpg","imageCredit":"Photo by Simon Migaj on Unsplash","html":"<h1 id=\"the-path-of-forgiveness\">The Path of Forgiveness</h1>\n<p>Forgiveness (which includes the ability to not only forgive others but also to forgive yourself) is key to psychological fitness, inner peace, contentment, fulfillment, and is an essential prerequisite to spiritual growth.</p>\n<p>Neglecting to forgive someone who has hurt you becomes a stored memory and can negatively affect your emotional wellbeing and psychological health indefinitely.</p>\n<p>And as the Chinese proverb describes – <em>‘If you are going to pursue revenge, you&#39;d better dig two graves!’</em></p>\n<p>Thoughts of revenge and retribution usually lead to feelings of resentment, anger, and even hatred; deep-seated emotions like a poison coursing through your veins, and so toxic for your health and wellbeing. We only punish ourselves when we refuse to forgive.</p>\n<p>Here are ten time-tested steps to foster feelings of forgiveness for someone who\nhas hurt you.</p>\n<h3 id=\"step-1-acceptance\">Step 1: Acceptance</h3>\n<p>Accepting that you can&#39;t change the past, or other people&#39;s perceptions of you, but that you can change your own attitude and view of the world. Accept and embrace every experience in life, the good and not so good, as an opportunity to grow. Accept that you have the power to choose how you respond to any given situation. Understanding this power to choose, that you are responsible for how you think and feel, can be a real gift. Appreciate that you have the power to let go of hurts and also to learn from them. This heightened awareness can provide you with new clarity and insights to foster a spirit of forgiveness. This always reminds me of the age old serenity prayer.</p>\n<blockquote>\n<p>  ‘Grant me the serenity to accept the things I cannot change, courage to change the things I can, and wisdom to know the difference&#39;</p>\n</blockquote>\n<h3 id=\"step-2-balance\">Step 2: Balance</h3>\n<p>Remember the underlying natural state of balance, harmony, and connectedness in all things. Your physical health, psychological fitness, emotional vitality and spiritual well-being are all deeply interconnected. Each supports and is supported by the others. So no matter how bad things appear or how challenging things become, stay connected to your spiritual side. Radiate more positive energy. Let your light shine.</p>\n<h3 id=\"step-3-your-words-have-power\">Step 3: Your words have power</h3>\n<p>Before you speak, listen. The words you use have power and meaning. Wherever your words go, your energy flows. Speak well of others and you will feel uplifted. Don&#39;t spend time or energy speaking of past hurts or mulling over perceived injustices. And speak well to yourself, quieten your inner critic and experience a new clarity and lightness of being.</p>\n<p>Don&#39;t end your day on a bad note by holding on to negative thoughts or emotions. Give your subconscious mind the gift of peace by using positive affirmations to end each day well.</p>\n<p>For Example:</p>\n<blockquote>\n<p>  &#39;I am fulfilled, I am peace, I am love, I am forgiveness&#39;</p>\n</blockquote>\n<h3 id=\"step-4-let-go-of-the-past\">Step 4: Let go of the past.</h3>\n<p>There&#39;s a wonderful African proverb -</p>\n<blockquote>\n<p>  &#39;You can outrun what&#39;s running beside you but not what&#39;s running inside you&#39;</p>\n</blockquote>\n<p>At the risk of stating the obvious, the past has had its day. Let it go. Learn from it certainly; in fact the past can be a wonderful teacher. But holding on to past hurts and grievances is ultimately self-destructive and takes from your ability to enjoy the present. Let the past go and live more in the present moment. Being more mindful and present is a gift to your sense of well-being - fostering feelings of forgiveness and liberty.</p>\n<h3 id=\"step-5-let-go-of-the-need-to-be-right-or-to-control-others\">Step 5: Let go of the need to be right or to control others</h3>\n<p><em>Needing to be right implies rigidity and lack of flexibility, not a good mind-set for forgiveness, compassion or tolerance. And stop telling people what to do if and when they are perfectly capable of making their own decisions.</em></p>\n<p>The poet Kahlil Gibran reminds you –</p>\n<blockquote>\n<p>  &#39;Your children are not your children\n  They are the sons and daughters of\n  Life&#39;s longing for itself. They come\n  Through you but not for you .....&#39;</p>\n</blockquote>\n<p>When you stop trying to control others according to the whims and demand-led expectations of your own ego, you can release feelings of frustration and experience lightness.</p>\n<h3 id=\"step-6-stop-living-on-the-offensive\">Step 6: Stop living on the offensive!</h3>\n<span class=\"pull-quote\">\nIt's easy to take offence, to become affronted if you choose to. It's your choice! Just remember that no one has the power to make you feel uncomfortable without your permission. Let go of petty resentments. So stop blaming and complaining. Don't be so quick to take things personally. And don't hold on even if you believe you're right and you have a right to! Before you judge, forgive.\n</span>\n\n<p>There&#39;s an old Sioux Indian saying:</p>\n<blockquote>\n<p>  &#39;Don&#39;t judge a man until you have walked two moons in his moccasins.&#39;</p>\n</blockquote>\n<p>Everyone sees the world through the lens of their own experiences; committing to really understand the position and world view of others makes it so much easier to forgive.</p>\n<h3 id=\"step-7-first-change-yourself\">Step 7: First change yourself</h3>\n<p>Embrace those negative emotions -face your fears, address anxiety and anger, evade envy, let go of guilt. Bring more heartfelt positive emotions and feelings into your life -feelings like inspiration, and enthusiasm and good old-fashioned fun. Lighten up, laugh more and learn to live more lightly; allowing needless negativity to dissolve away.</p>\n<h3 id=\"step-8-build-a-gratitude-habit\">Step 8: Build a gratitude habit.</h3>\n<p>Expressing gratitude regularly, by remembering to truly want what you have in life; engenders forgiveness, freedom from regrets of the past, anxieties about the future, and freedom from envy about what you don&#39;t have or who you are not. </p>\n<p>End each day well. Ask yourself what good did I do today to support others? What am I grateful for? Expressing gratitude can be a wonderful antidote to feelings of hostility, envy or needless negativity.</p>\n<p>I&#39;m reminded of the wonderful Persian poet Saadi who wrote in The Rose Garden in 1259 –</p>\n<blockquote>\n<p>  &#39;I bemoaned the fact I had no shoes until I saw the man who had no feet.&#39;</p>\n</blockquote>\n<h3 id=\"step-9-be-kinder-and-more-compassionate\">Step 9: Be kinder and more compassionate</h3>\n<p>Live more from your heart, embrace heartfelt compassion and forgiveness, for there&#39;s more hunger for love and appreciation in this world than there is for bread. </p>\n<p>Thousands of years ago, the philosopher Plato wisely wrote that to be kind to\neveryone you meet is fighting a hard battle. Committing to being the kindest and\nmost compassionate person that you can be is a gift not only to others, but also\nto yourself. Compassion is heartfelt empathy and concern for all living\ncreatures.</p>\n<p>I&#39;m inspired by the Dalai Lama&#39;s commitment to compassion and the soothing words\nof his loving-kindness meditation</p>\n<blockquote>\n<p>  &#39;May you be loving, may you be healthy, may you be happy&#39;</p>\n</blockquote>\n<h3 id=\"step-10-be-the-change\">Step 10: Be the change</h3>\n<p>Thousands of years ago, the philosopher Plato wisely wrote that to be kind to everyone you meet is fighting a hard battle. Committing to being the kindest and most compassionate person that you can be is a gift not only to others, but also to yourself. Compassion is heartfelt empathy and concern for all living creatures.</p>\n<p>If you want more love in your life, be more loving. Let love be your path. If you want more peace in your life, be more peaceful. Let peace be your path. If you want more forgiveness in your life, be more forgiving. Let forgiveness be your path.</p>\n<p>The Chinese Bamboo Tree, my favourite tree and a wonderful metaphor for health and vitality, grows tall and strong, yet is also flexible and adaptable. True strength in life requires flexibility, tolerance and forgiveness.</p>\n<p>Remember the only person you can change in this life is YOU!</p>\n","slug":"the-path-of-forgiveness","categorySlug":"self-help","summary":"<p>Accepting that you can&#39;t change the past, or other people&#39;s perceptions of you, but that you can change your own attitude and view of the world. Accept and embrace every experience in life, the good and not so good, as an opportunity to grow. Accept that you have the power to choose how you  <span class=\"summary-ellipsis\">[...]</span></p>"},{"title":"Entering The Global Marketplace","description":"Written For Incasso Partners","author":"Rob Power","category":"Economics","date":1468953000000,"image":"laptop-graphs.jpg","imageCaption":"Photo by Lukas Blazek on Unsplash","html":"<h1 id=\"entering-the-global-marketplace\">Entering the Global Marketplace</h1>\n<p>The international Marketplace offers myriad possibilities for growth and profit, and as a result is a highly attractive prospect to many kinds of businesses. However there are many pitfalls and obstacles associated with becoming a multinational entity. To help you make the best decisions in this regard, here are a few areas to think about when going global.</p>\n<h2 id=\"political-pitfalls\">Political Pitfalls</h2>\n<p>During times of economic recession, studies have shown that nationalistic consumer behaviour increases. This means that the outsourcing of labour, or merely buying foreign products before those made in one’s own country become more frowned upon. The result is that you could incur bad publicity in your home market or indeed suffer in your international markets. It is worth remembering to highlight your nationality to your home customers during these periods to benefit from this kind of consumer sentiment.</p>\n<h2 id=\"legality--morality\">Legality &amp; Morality</h2>\n<p>First of all it is important to have an understanding of the pertinent legalities in all countries of operation. This may range of ensuring the proper export duty costs are built in to your business strategy, to checking the status of your product in the destination market. Remember Kinder surprises were illegal in the U.S until recently! In addition to this, things may be legal in a certain jurisdiction but potentially not morally acceptable for your broader consumer base. For example, you may have a production facility with working conditions that are all above board in the country of operation, but your broader consumer base may find them unacceptable thus generating considerable negative publicity for your company.</p>\n<h2 id=\"the-right-staff\">The Right Staff</h2>\n<p>For many countries, it is essential that you have somebody overseeing your business that not only has a comprehensive cultural understanding of the country of operation, but also understands your needs and requirements as someone who is sensitive to moral and cultural sensitivities of their broader customer base. </p>\n<h2 id=\"international-debt-collection\">International Debt Collection</h2>\n<p>Different jurisdictions and cultures require different approaches when recovering outstanding debt. This applies both to both non-legal negotiations when local cultural knowledge is paramount and legal recourse where different jurisdictions require local experts to proceed. IncassoPartners negate this obstacle by having over 20 years’ experience in global debt collection and trusted partners in all jurisdictions. In addition to this, our “no recovery, no fee” system affords the multi-national entrepreneur peace of mind that no costs will be incurred without a positive outcome regarding their outstanding debt.</p>\n","slug":"entering-the-global-marketplace","categorySlug":"economics","summary":"<p>The international Marketplace offers myriad possibilities for growth and profit, and as a result is a highly attractive prospect to many kinds of businesses. However there are many pitfalls and obstacles associated with becoming a multinational entity. To help you make the best decisions in this reg <span class=\"summary-ellipsis\">[...]</span></p>"},{"title":"The Shifting Sands Of Brazil","description":"Written For Incasso Partners","author":"Rob Power","category":"Economics","date":1468607400000,"image":"rio.jpg","imageCaption":"Photo by Julianna Kaiser on Unsplash","html":"<h1 id=\"the-shifting-sands-of-brazils-economy\">The Shifting Sands of Brazil’s Economy</h1>\n<p>Today Brazil has the tenth largest economy in the world but this is a relatively new situation by global economic standards. Between the years 2000 and 2012, Brazil ranked high amongst the fastest growing major economies in the world, achieving this through an average annual GDP growth surpassing 5%. This success was largely driven by measures taken by the government to liberalize the economy creating a much more fertile environment for private sector investment. Additionally, while Brazil always benefitted from its richness in natural resources, its growing trade with China throughout this period proved hugely beneficial to the nation as a whole. This growth culminated in 2012 when Brazil surpassed the UK in terms of economy as well as achieving 5th in the world ranking of US dollar billionaires. However, in 2013 the tide turned for Brazil with a major deceleration of growth which has escalated to the point where all forecasts predict a contraction of around 1% this year.</p>\n<h2 id=\"the-roots-of-brazils-downturn\">The Roots of Brazil’s Downturn</h2>\n<p>Certainly it would be fair to say that some of the causes of Brazil’s economic woes are external and as such, outside of their control. The deceleration of the Chinese economy for example has a considerable knock on effect, being the number one trading partner of the nation. Furthermore, belt tightening in the US, which stifles the flow of dollars into the country, has considerable consequences for the flagging economy. There are also domestic factors at play here; with the Petrobras corruption having a sizeable ripple effect throughout the economy. Petrobas, the state oil company, is being investigated for massive scale corruption, a case which has all but paralysed the hugely important oil industry. Compounding these factors is the rate of inflation, which seems to be currently stuck at the entirely inappropriate rate of 8%. Consumer confidence is falling, unemployment is rising, and the outlook seems bleak for the Latin American giant.</p>\n<h2 id=\"moves-to-improve\">Moves to Improve</h2>\n<p>In a report published by the International Monetary Fund (IMF) in early May of this year, the recommendations boil down to a word that citizens of many EU countries have become all too familiar with in recent years – austerity. This would include, but not be limited to, higher taxes and spending cuts in a country that has suffered quite a bit of civil unrest in recent history. This puts the Brazilian government in a very difficult position with the task of developing public confidence in the necessity for such austere measures.</p>\n<h2 id=\"should-you-invest-in-brazil\">Should You Invest in Brazil?</h2>\n<p>As much as times are currently bad in Brazil, the news is not all bad. The Chinese, for example, have recently pledged $250m to Latin America over the next 10 years. It seems likely much of this will land in Brazil as work is about to commence on a China funded railway line to run from Brazil’s Atlantic coast all the way to the Pacific coast of Peru. This investment is part of what has been dubbed the Chinese “economic colonisation” of Brazil. While there have been criticisms that China is benefitting more from the relationship than Brazil, China’s history of a pragmatic approach to business relations would suggest that the scales may be balanced in the coming years. Luiz Eugenio Figueiredo, vice-president of Brazil’s private equity and venture capital association ABVCAP, suggests that the current downturn might signal opportunity for foreign investment saying “It’s a good moment for investments because the sources of funding for non-listed companies are very restricted”. Of course, like all new markets, there are differing ways of doing business than you are likely used to, and it can take time and research to understand how to best work with your potential partners in Brazil. It might be prudent to align yourself with an international debt recovery organisation in order to ensure you minimize fiscal exposure and garner advice on how best to enter into contracts. An international debt collection expert can help to clarify the muddy waters of what is still a market of substantial potential.</p>\n<h3 id=\"need-help-with-international-debt-recovery\">Need help with International Debt Recovery?</h3>\n<p>If your business needs any help recovering debt either in your domestic market or any international market, Incasso Partners provide the complete solution. With their multi-jurisdictional expertise, and “no recovery, no fee” policy, there is no better way to recover the funds owed to you.\nFind out more today by visiting - <a href=\"http://incassopartners.com/\">http://incassopartners.com/</a></p>\n","slug":"the-shifting-sands-of-brazil","categorySlug":"economics","summary":"<p>Today Brazil has the tenth largest economy in the world but this is a relatively new situation by global economic standards. Between the years 2000 and 2012, Brazil ranked high amongst the fastest growing major economies in the world, achieving this through an average annual GDP growth surpassing 5% <span class=\"summary-ellipsis\">[...]</span></p>"},{"title":"Why Irish Eyes Are Smiling","description":"Written For Incasso Partners","author":"Rob Power","slug":"why-irish-eyes-are-smiling","category":"Economics","date":1468607400000,"image":"dublin-night.jpg","imageCaption":"Dublin at night","html":"<h1 id=\"why-irish-eyes-are-smiling\">Why Irish Eyes Are Smiling</h1>\n<p>In economic terms, there was scarcely a part of the world unaffected by the economic crash of 2008. The ripple effects were truly global though some countries fared worse than others. Ranked highly on all lists of countries most affected is Ireland. In fact the impact on Ireland was made far worse by circumstances because up until 2007, Ireland were settling in to their strongest economic period in history; what was known in the press as the Celtic Tiger. To put it in individualistic terms, pride came before the fall. There may have been a certain amount of hubris involved in Ireland’s eventual crash, not least by the developers and bankers who had only seen their fortunes grow consistently for the previous decade. Regardless of whether mistakes were made on high, the consequences were suffered in the trenches. Unemployment grew from an almost negligible 4% in 2007 to a whopping 15% in 2011. Construction stopped, spending stopped, young people fled for greener pastures, and overseas investment faltered; waiting to see what would rise from the ashes.</p>\n<h2 id=\"so-how-are-conditions-for-business-in-2015\">So how are conditions for business in 2015?</h2>\n<p>Before getting into the facts of figures of the current state of the Irish economy, it should be established that all growth percentages should be put in the context of a very low base level. So while there is much positivity to be garnered from the following information, it is important to remember that it is still early days economically. That being said, here are the reasons Irish eyes are smiling!</p>\n<h2 id=\"irelands-economy-consistently-grows-faster-than-predictions\">Ireland’s Economy Consistently Grows Faster than Predictions</h2>\n<p>The International Monetary Fund (IMF) are now forecasting a 3.9% rise in GDP for 2015, up 0.4% on previous predictions. They are also forecasting growth of 3.3% for 2016 again up on earlier predictions. These figures put Ireland in pole position for economic growth in the Eurozone, a situation that has felt unlikely to its citizens for a number of years. So what is driving all this growth? \nWell a number of political initiatives have seen a resurgence of investment, with business spending on machinery and equipment up 30% last year. Pharmaceutical exports have fared particularly well with a marked increase in employment in this sector. 2015 also saw an increase in consumer confidence, particularly reflected in the automotive market, although the services sector is still showing some contraction as post-recession pragmatism continues to endure.</p>\n<h2 id=\"will-this-growth-continue\">Will this Growth Continue?</h2>\n<p>The upshot of all this is that the government is likely to have approximately 1.5 billion available to return to the economy in the upcoming budget. Given that an election is on the horizon and it would be understandable to conclude that this money is likely to be spent on tax cuts, social benefits, and other things that will further buoy the spirits of the Irish citizenry. When you had the accelerated reduction in the unemployment rate (due to drop to 8.8% next year) it would seem that magic ingredient of consumer sentiment should at least be positive in the short term. Indeed perhaps some new found pragmatism in terms of finance will imbue some stability into the Irish economy that we retrospectively know did not exist during the boom years.</p>\n","categorySlug":"economics","summary":"<p>In economic terms, there was scarcely a part of the world unaffected by the economic crash of 2008. The ripple effects were truly global though some countries fared worse than others. Ranked highly on all lists of countries most affected is Ireland. In fact the impact on Ireland was made far worse b <span class=\"summary-ellipsis\">[...]</span></p>"},{"title":"Is Japan Falling on it's Sword?'","description":"Written For Incasso Partners","author":"Rob Power","category":"Economics","date":1466188200000,"image":"tokyo.jpg","imageCaption":"Photo by Carlos Quiapo on Unsplash","html":"<h1 id=\"is-japan-falling-on-its-sword\">Is Japan Falling on its Sword?</h1>\n<h2 id=\"why-a-shrinking-and-aging-population-is-playing-havoc-with-the-economy\">Why a Shrinking and Aging Population is Playing Havoc with the Economy</h2>\n<p>As long as I can remember I have been hearing people extoll the virtues of Japanese products, particularly automobiles. A belief solidified in my psyche having owned and extensively punished a Toyota Corolla over the course of fifteen years. I crashed it causing extensive damage, I drove across Europe, and I failed to put oil in for a couple of years when I was young and reckless. Still it soldiered on, reliably taking me where I needed to go without complaint. That longevity would be a virtue to Japanese industry is unsurprising considering it is a strength they boast as a nation. The Japanese have the longest average national lifespan in the world, with the men averaging 84 years and their female counterparts averaging an enviable 87. This is usually attributed to a combination of diet and genes among other factors, but of course these things are difficult to quantify. Long life spans alone are no cause for panic, economically speaking. However, when combined with another variable, the demographics of Japan are rapidly shifting to a place where urgent economic reforms will be required to maintain stability in a once prolific and robust economy.</p>\n<h2 id=\"the-birth-rate-is-plummeting\">The Birth Rate is Plummeting</h2>\n<p>There have been numerous studies lately into why Japanese people seem to be developing an indifference to sexual contact and relationships in general. While the root causes of this phenomenon are still unknown, with many interrelated theories in circulation, the figures these studies are revealing are quite surprising. First of all the number of single people has never been higher; a 2011 survey found that  61% of unmarried men and 49% of women aged 18-34 were not in any kind of romantic relationship, a whopping 10% higher than a survey a mere 5 years previous. A survey only this year on women aged between 16 and 24 found that 45% of them were “not interested in or despised sexual contact”. They even found that more than a quarter of men feel the same way. I haven’t done a survey but my instincts tell me that boys of that age in Europe would deliver a markedly different response. \nIt’s worth taking into consideration that Japan was already a nation with a low birth rate; so these developments are certain to worsen what is already a bad situation, demographically. Consider this trajectory; in 1989, 11.6% of the Japan’ population was over 65. In 2006, it rose to 20%. In 2055, it is predicted to reach 38%. The most symbolic indicator of the currently state of play is that, in 2012, adult incontinence pants sold more than baby nappies for the first time. The older generation needs taking care of, and they have earned it, but without a sufficient birth rate, who is going to be there to do it?</p>\n<h2 id=\"an-economy-in-crisis\">An economy in crisis</h2>\n<p>So as the shrinking birth rate ensures the country struggles to find replacements for people who are retiring, the growing numbers of elderly are increasing dependence on a declining working population. Something has got to give. Milton Ezrati, writing for foreign affairs posits that there will be numerous long reaching consequences. Japan’s trade surplus is sure to fall victim to a population which no longer can produce as much as it consumes. Their highly regulated industrial sector will have to open up to new ways of doing things. They are likely to begin outsourcing to a much greater extent, which Ezrati concludes will cause the necessity for a more “hands on” foreign policy – “Though such a move goes against present Japanese instincts, no nation, including Japan, can afford to locate its production facilities abroad and not develop the capability to at least threaten to project power to protect those sources of wealth.” So it seems that this combination of aging population and reluctant lovers may lead to a complete shift in geo-politics in Asia at least. But what can be done moving forward?</p>\n<h2 id=\"japans-next-move\">Japan’s next move</h2>\n<p>Well it wouldn’t be Japan if technology wasn’t being used to present some outlandish suggestions on how to move through this crisis. Exoskeletons are being developed which would allow elderly people perform manual labour for years past the current retirement age. While this is unlikely to be the solution to the problem, maybe it will work in concert with many other initiatives to help Japan navigate this unknown territory. There are likely to be many unpopular changes to the social welfare system which cost the government 5.77% of its national income in 1970. In 2012 it was 31.34% and is most definitely rising. Again, somethings got to give. Another area of interest moving forward is one of immigration. Japan has a relatively tight immigration policy and occasionally earns rebuke from both within and without for being mono-cultural. Their country is highly attractive to young people who would be interested in immersing themselves in the culture and exploring the enigmatic nation. </p>\n<h2 id=\"investing-in-japan\">Investing in Japan</h2>\n<p>While the current issues I have written about may point towards there being less disposable income in Japan in the near future, the probable change in immigration policy and business practices are likely to present opportunities for those interested in doing business in Japan. There is a huge amount to be gained from entering this marketplace. Not just from its own direct profitability but from what you can learn about the future of other regions, because the truth is, Japan is not alone in its demographical issues. Almost all developed nations are about to follow suit. Japan is about to begin to solve a problem that is on its way to many of our economies in the not too distant future. Japan has a very traditional business culture and as such can be difficult to negotiate for the new investor or entrepreneur. With this in mind we advise aligning oneself with an established international debt collection agency in order to ensure best business practises when entering a new marketplace, such as Japan. </p>\n<h2 id=\"need-help-with-international-debt-recovery\">Need help with International Debt Recovery?</h2>\n<p>If your business needs any help recovering debt either in your domestic market or any international market, Incasso Partners provide the complete solution. With their multi-jurisdictional expertise, and “no recovery, no fee” policy, there is no better way to recover the funds owed to you.\nFind out more today by visiting - <a href=\"http://incassopartners.com/\">http://incassopartners.com/</a></p>\n","slug":"is-japan-falling-on-it's-sword'","categorySlug":"economics","summary":"<p>As long as I can remember I have been hearing people extoll the virtues of Japanese products, particularly automobiles. A belief solidified in my psyche having owned and extensively punished a Toyota Corolla over the course of fifteen years. I crashed it causing extensive damage, I drove across Euro <span class=\"summary-ellipsis\">[...]</span></p>"},{"title":"Releasing the Happiness Within","description":"Written for Dr. Mark Rowe","author":"Rob Power","category":"Self Help","date":1463682600000,"image":"happiness.jpg","imageCredit":"Photo by Jared Sluyter on Unsplash","html":"<h1 id=\"releasing-the-happiness-within\">Releasing the Happiness Within</h1>\n<h3 id=\"pause-for-a-moment-and-ask-yourself-this-question\">Pause for a moment and ask yourself this question…</h3>\n<p>How many people do I know that are genuinely thriving in happy, fulfilling, and purposeful lives?\nIt’s not that easy to think of candidates who fit the criteria is it? The disappointing reality is that even if you reckon 3 out of 10 in your network fit the bill, then you are enjoying an above average share of highly positive people in your life. Research has found that only about 20% of people see themselves as flourishing, or living close to their optimum potential. Unfortunately the other 80% identify as living a great deal less fruitfully than they know they are capable of. </p>\n<p>The problem is the human brain is not hardwired for happiness, but for survival. Happiness should manifest itself as a bonus when the needs of survival have been met. However, modern society presents us with so many challenges, so much negativity, and in such a perpetually distracting way, that it is my belief that happiness and fulfilment are no longer optional extras, but essential needs to be cultivated to ensure our wellbeing and that of those around us.</p>\n<p>The good news is that there are simple methods to train ourselves to develop happiness boosting habits. Adopting this approach won’t just impact on how we feel, our physical health, and our wellbeing; but it also contributes greatly to our ability to become successful in our lives. Of course success is subjective, it means different things for different people, but regardless of whether your idea of success pertains to career, relationships, health, or productivity; maintaining a positive outlook is an important first step in the right direction to achieving your full potential. And be assured that the contagious nature of positivity will guarantee that you will be surprised by countless other benefits when you bring your happiness into all your day to day interactions.</p>\n<blockquote>\n<p>It is my belief that happiness and fulfillment are no longer optional extras, but essential needs to be cultivated to ensure our wellbeing and that of those around us.</p>\n</blockquote>\n<p>As humans we enjoy the most satisfaction when we are engaged in positive relationships, have meaningful productivity, and a sense of purpose and accomplishment. In the end, we are greatly affected by what we do, and by extension we are more affected by what we do every day, than those things we rarely find the time to do. The smallest of actions exceeds the noblest of intentions. What this means is that we must endeavour to take action on those things we wish to do, simply dwelling on the idea of them isn’t enough, and can indeed have negative effects on us as we develop a tension between what we think, and what we do.</p>\n<p>Beneficial behaviours can become just as habitual as destructive ones so each of us can empower ourselves by building habits such as expressing gratitude, exercise, and embracing realistic optimism. But we must make that choice to take action, embrace the belief that the potential for everyday happiness lies within each and every one of us. Releasing this potential will provide you with more balance and harmony, and it is this foundation that can truly provide a platform for success, and for a life of significance.</p>\n<p>For more on releasing the happiness within and the small choices that make big changes, visit <a href=\"http://www.doctormarkrowe.com\">www.doctormarkrowe.com</a></p>\n","slug":"releasing-the-happiness-within","categorySlug":"self-help","summary":"<p>The problem is the human brain is not hardwired for happiness, but for survival. Happiness should manifest itself as a bonus when the needs of survival have been met. However, modern society presents us with so many challenges, so much negativity, and in such a perpetually distracting way, that it i <span class=\"summary-ellipsis\">[...]</span></p>"},{"title":"Italy, A Country Divided","description":"Written For Incasso Partners","author":"Rob Power","category":"Economics","date":1463509800000,"image":"colesium.jpg","imageCaption":"Photo by Jace Grandinetti on Unsplash","html":"<h1 id=\"italy--a-country-divided\">Italy – A Country Divided</h1>\n<p>It has been a while since there has been any positive news with regard to the Italian economy. This month, with the release of statistics for the first quarter of 2015, there is finally a glimmer of hope, a tiny green shoot in soil, the fertility of which was beginning to come into question. So after three years of almost continuous recession (having only briefly exited a previous one) Italian GDP grew by a modest 0.3%. This growth is small but given the difficult times that Italy has experienced, even lagging behind the rest of the Eurozone pre-crisis, it still may be cause for optimism. The truth is, however, if we assess Italy’s economy holistically, we can’t fail to see a massive disparity between the northern and southern regions of the nation.</p>\n<h2 id=\"a-world-of-difference\">A World of Difference</h2>\n<p>It is not uncommon for national statistics to gloss over regional inconsistencies but in the case of Italy, these differences are more substantial and it wouldn’t be a stretch to suggest that there are two very distinct economies in play. This divide has its roots in history; even as far back as the unification of Italy in 1861 when economic measures imposed on the south caused an untenable situation for agricultural businessmen, many of whom chose to emigrate in the ensuing decades. Later, when Mussolini was defeated, bringing an end to the fascist period, the allies chose, probably out of necessity, to hand the reigns back to the mafia families, most prevalent in the south. Many commentators point to this enduring widespread corruption as a factor that has been an obstacle to sustained economic development in the area. It is not difficult to understand investors’ reluctance when a 2007 study discovered that an estimated 80% of businesses paid protection money in the Sicilian cities of Catania and Palermo. Causes aside, when we examine modern statistics, the stark differences between the regions are plain to see.</p>\n<p>The economy of Italy as a whole shrank by 0.2% in the period 2001 – 2013. If we look at this regionally we see a much different story, with the North growing by 2% and the South contracting by 7%. This is partially due to the South’s pre-crisis weaknesses, but for the most part; it is the far more catastrophic effects felt in the South post-crisis; which saw the region contract at almost twice the rate of their neighbours to the north. The resultant 13% contraction in the economy, when contrasted to the 7% contraction in the North, gives as clear a picture as any that the odds are stacked against the Mezzogiorno (the southern regions). Due to this disparity, the Italian economy is often both weaker and stronger that the general statistics would lead you to believe, depending on which region you focus on. The differences don’t end here unfortunately; when we examine the number of families living in poverty we see further evidence. In the period 2007 – 2013 the Northern region saw the poverty figure grow from 3.3% to 5.8%. Dismally, the latter figure, 5.8%, was the starting point down south, and it soared to a depressing 12.6% in the same period. The unemployment stats help to round out the picture. Out of the 943’000 Italians that became unemployed between 2007 and 2014; 70% of them were southerners. Of course this situation perpetuates and exacerbates itself through emigration; the young demographic of the Mezzogiorno having no option but to seek greener pastures. So can Italy progress as a whole in the coming years?</p>\n<h2 id=\"can-italy-sustain-growth\">Can Italy Sustain Growth?</h2>\n<p>Italy’s Prime Minister, Matteo Renzi, recently visited the white house and used stereotypically flowery language to describe the trajectory of Italy’s economy saying   Whether or not this is true remains to be seen. Like many of the Eurozone countries, Italy’s recent modest successes are likely to have been supported by external factors. Recent quantitative easing combined with low oil prices are undoubtedly contributory factors. Politically, at least, it seems as though the status quo is beneficial for growth. Renzi has implemented business friendly economic reforms which would point towards an improved climate for investment. There is slow but consistent progress against corruption with government initiatives gradually weakening the grip of organised crime. Political upheavals could have detrimental effects on the economy, however, both at home and abroad. Positively, there seems to be little challenge to the current administration in a time with consistency would be beneficial. Further afield, Italy’s fortunes are connected to Russia as a substantial trading partner. Recent sanctions relating to the Ukrainian issue are not doing them any favours. Greece is another sensitive point. Italy’s close ties with Greece mean that, if they did defect from the Euro, the effects would be felt right across the Apennine Peninsula. </p>\n<h2 id=\"time-to-invest-in-italy\">Time to Invest in Italy?</h2>\n<p>There is no doubt that things are still uncertain in Italy. But with favourable economic legislation and a reduction in organised crime, the pastures are getting more fertile. Businesses are still struggling though and as a new player entering the market it would be prudent to ensure that you don’t let outstanding debts linger too long. With this in mind it is often wise to align yourself with a professional international debt collection agency who can use local experience to recover any debts you are owed anywhere in the country.</p>\n<h3 id=\"need-help-with-international-debt-recovery\">Need help with International Debt Recovery?</h3>\n<p>If your business needs any help recovering debt either in your domestic market or any international market, Incasso Partners provide the complete solution. With their multi-jurisdictional expertise, and “no recovery, no fee” policy, there is no better way to recover the funds owed to you.\nFind out more today by visiting - <a href=\"http://incassopartners.com/\">http://incassopartners.com/</a></p>\n","slug":"italy-a-country-divided","categorySlug":"economics","summary":"<p>It has been a while since there has been any positive news with regard to the Italian economy. This month, with the release of statistics for the first quarter of 2015, there is finally a glimmer of hope, a tiny green shoot in soil, the fertility of which was beginning to come into question. So afte <span class=\"summary-ellipsis\">[...]</span></p>"},{"title":"From Success to Significance","description":"Written for Dr. Marke Rowe","author":"Rob Power","category":"Self Help","date":1461177000000,"image":"droplet.jpg","imageCredit":"Photo by zhang kaiyv on Unsplash","html":"<h1 id=\"moving-from-success-to-significance\">Moving from Success to Significance</h1>\n<p>To use a sporting analogy, life can be considered a game of two halves. The first half is so often suffused with chasing something - better grades at school and at college, leading to bigger jobs, better careers and bulkier bank balances. Much needs more, bigger is better, even more is even better. Life becomes a competitive race dominated by ego, image, and survival of the fittest. The underlying assumption being that who we are is determined by what we have and what other people think about us.Indeed some people spend their entire lives living out this paradigm, which is a real pity because it&#39;s an illusion, a lie you were sold or bought into.</p>\n<p><em>Confucius once wrote:</em> </p>\n<blockquote>\n<p>We all have two lives, and your second life begins the moment you realise you only have one life. </p>\n</blockquote>\n<p>Because there is a second half to this game of life, with the dawning realisation that less is more, that the real purpose of life is a life of purpose and contribution; that while we make a living from what we do, we make a life from what we give.</p>\n<p>And you don&#39;t have to wait until the second half of life to start living and playing from a mind-set of purpose and contribution. You don’t need to have all the answers to begin living with gratitude and generosity, in fact it can be living this way that helps you to find what you’re looking for.</p>\n<p>We all have something to share, something to give, and by simply opening our eyes opportunities will present themselves from every direction. Begin today, right here, right now, by doing what you can with what you have. The prize is that your life becomes richer, and more fulfilled as you reap the bountiful benefits of purpose and possibility. </p>\n","slug":"from-success-to-significance","categorySlug":"self-help","summary":"<p>To use a sporting analogy, life can be considered a game of two halves. The first half is so often suffused with chasing something - better grades at school and at college, leading to bigger jobs, better careers and bulkier bank balances. Much needs more, bigger is better, even more is even better.  <span class=\"summary-ellipsis\">[...]</span></p>"},{"title":"The Rise And Rise Of China","description":"Written For Incasso Partners","author":"Rob Power","category":"Economics","date":1460745000000,"image":"hong-kong.jpg","imageCaption":"Photo by Chester Ho on Unsplash","html":"<h1 id=\"the-rise-and-rise-of-china\">The Rise and Rise of China</h1>\n<blockquote>\n<p> “when the red dragon awakes, she will shake the world”- Napolean</p>\n</blockquote>\n<p>While Napoleon’s fears are said to be based on the vast populations of poverty stricken citizens at a time when sheer numbers really meant something militarily, it is a different kind of force that China has used to shift the world on its axis in recent decades. Instead of vast armies, China now has vast legions of SME’s; there are more small-to-medium enterprises in China than there are in the U.S and Europe combined! Instead of attacking the world with armies, China has flooded it with its goods. In 1990 China accounted for approximately 3% of world manufacturing by value, that figure has now risen to almost 25%. Included in this are 70% of the world’s mobile phones, 80% of its air conditioners and 60% of its shoes!</p>\n<h2 id=\"is-chinas-grip-on-world-manufacturing-weakening\">Is China’s grip on world manufacturing weakening?</h2>\n<p>Any economist will tell you, that activity such as China has experienced in recent years will cause great inflation. As a result of this wages will rise therefor reducing the attractiveness of it as a manufacturing hub. This process, however, is not loosening China’s grip on manufacturing, if anything it’s tightening it. It’s such a vast nation that much of the inflation just doesn’t permeate into all areas, particularly when it comes to basic cost of living. In addition to this, the low cost labour that does leave the country is, for the most part, going to South-East Asia. China tends to maintain a big part in the supply chain for this and as such has a vested interest in keeping this production in Asia. In recent years China has begun producing far more of the materials that go into their goods with imported components falling from a high of 60% in the mid 90’s to around 35% currently. These raw materials can be sold on to production in satellite Asian countries reducing any negative impact of low cost labour leaving their borders. In addition to this, China will be well aware that a strong manufacturing market such as theirs can only greatly benefit from the enrichment of the markets on their doorstep. They have learned this lesson from the next great driver of their economy – their exploding middle class.</p>\n<h2 id=\"the-new-economy-of-china\">The New Economy of China</h2>\n<p>In 2011 a construction company in China erected a prefabricated 30 story skyscraper in 15 days. A time lapse of this astonishing feat of engineering can be seen here:\n<a href=\"https://www.youtube.com/watch?v=ajlUVSiUvWg\">https://www.youtube.com/watch?v=ajlUVSiUvWg</a>\nThis amazing achievement is an accurate metaphor for the growth of the Chinese middle class. When China began building itself on manufacturing, its customer base was very much the wealthier parts of the globe, but now in 2015 the Chinese middle class numbers over 300 million people, larger than the entire population of the United States. And just as the magnificent building is earthquake resistant and highly energy efficient, so too are the tastes of the new Chinese wealthy, modern and refined.  The market for luxury goods has skyrocketed allowing for greater diversification in manufacturing for the domestic market and offsetting rising wage costs significantly.  This taste for luxury goods is exemplified by the recent Chinese obsession with wine, particularly that of the Bordeaux region in France where Chinese interest in the product has been by far the most powerful influence in the market price in recent years. In fact, China now ranks No. 2 in in U.S. dollar Billionaires, just behind the U.S. themselves. Although experts in the Chinese economy would say that due to the sometimes shadowy nature of business in China, perhaps they are No. 1!</p>\n<h2 id=\"business-potential-in-china\">Business Potential in China!</h2>\n<p>China represents an unbelievably attractive prospect for almost any industry. They are a proud and curious people who are always interested in new things but now so many of them have the finances to explore their buying power. Of course, like all new markets, there are differing ways of doing business than you are likely used to, and it takes time and research to understand how to best work with your partners in China. It might be prudent to align yourself with an international debt recovery organisation in order to ensure you minimize fiscal exposure and garner advice on how best to enter into contracts. An international debt collection expert can help to clarify the muddy waters of what is quickly becoming one of the most fertile markets on the planet.</p>\n<h2 id=\"need-help-with-international-debt-recovery\">Need help with International Debt Recovery?</h2>\n<p>If your business needs any help recovering debt either in your domestic market or any international market, Incasso Partners provide the complete solution. With their multi-jurisdictional expertise, and “no recovery, no fee” policy, there is no better way to recover the funds owed to you.\nFind out more today by visiting - <a href=\"http://incassopartners.com/\">http://incassopartners.com/</a></p>\n","slug":"the-rise-and-rise-of-china","categorySlug":"economics","summary":"<p>While Napoleon’s fears are said to be based on the vast populations of poverty stricken citizens at a time when sheer numbers really meant something militarily, it is a different kind of force that China has used to shift the world on its axis in recent decades. Instead of vast armies, China now has <span class=\"summary-ellipsis\">[...]</span></p>"},{"title":"Finding Your Flow","description":"Written for Dr. Marke Rowe","author":"Rob Power","category":"Self Help","date":1456079400000,"image":"stream.jpg","imageCredit":"Photo by Phil Houston on Unsplash","html":"<h1 id=\"finding-your-flow\">Finding Your Flow</h1>\n<h2 id=\"the-power-of-flow-for-a-happier-and-more-successful-life\">The Power of Flow for a Happier and More Successful Life</h2>\n<p>The concept of an individual’s ‘flow’ has been comprehensively explored by the brilliant Russian psychologist Mihaly Csikszentmihalyi in his book Flow: The Psychology of Optimal Experience. His research originally investigated the habits of artists, whose intense focus and steely concentration when engaged in their process, had inspired his curiosity. He described witnessing their joy in creating for its own sake, and how they found personal fulfilment in the moment, without being preoccupied with the final product or indeed how it would be received.\nThe psychologist then expanded his research to interview thousands of people from many different backgrounds, discovering that creating flow experiences in your life can be a gateway to happiness; a profound tool in the creation of a productive and rewarding life. He found that flow is a universal psychological experience characterised by being engaged, happy, and energised. It involves a high level of productivity coupled with an appreciation for the fruits of one’s efforts. You must feel as though you are always pushing yourself but maintain the confidence that you have the ability it succeed. It is this combination that can so engage and absorb you that simply performing your activities can inspire a state of effortless concentration coupled with a feeling of enjoyment. It is this state that so many people describe as ‘being in the zone’, the effortless performance of the activity itself being its own reward.</p>\n<p>We are wired to experience pleasure when we perform at, or close to, the best of our abilities – peak experience through peak performance. Through giving ourselves the opportunity to perform at our best, we can engender profound changes in our overall wellbeing. Through entering these states of flow, we become more confident and self-assured, we view ourselves with greater admiration, and we are inclined to view life’s obstacles as far less challenging. </p>\n<p>While twenty percent of people regularly enter flow states, unfortunately, Csikszentmihalyi, has found that fifteen percent never do. This is a great shame as experiencing a state of flow is the clearest view we can get of our own potential. When we find flow in our lives, we don’t only become more productive, but within this productivity we also become more playful, creative, and authentic. Just as the spirit of gratitude is learning to want what you have, the essence of flow is being in the moment; where action and awareness are merged.</p>\n<h2 id=\"the-experience-of-flow\">The Experience of Flow</h2>\n<p>Imagine having the boundaries of your focus and abilities pushed, but not broken. Your engagement level is maxed out but you are not fazed by insecurities. You have mind-mapped your tasks and you proceed through them without doubt or hesitation. It is an experience often experienced by those who play sports. Tennis for example is a sport in which a state of flow is regularly experienced. There is a clear set of rules that require appropriate responses. The ball must be returned to your opponent’s court, giving immediate feedback on the success of your actions. However, when each point ends, no-one dwells on the result of the previous point, they merely re-engage with their focus and return to their flow. </p>\n<p>It is not just athletes who experience flow however, many of us do from time to time in situations such as driving the car, cooking, studying, gardening, creative pursuits, or satisfying work. Perhaps we even feel it when we are engaged in a conversation with friends. It is important to recognise these moments so that we can better channel them into other areas of our lives. For myself, it is in speaking to individuals and groups about health leadership and happiness that I often find myself in the zone! As the saying goes, do what you love and love what you do!</p>\n<h2 id=\"the-benefits-of-flow\">The Benefits of Flow</h2>\n<p>When we are enjoying the experience of flow, our fear of failure is often replaced with an underlying feeling of enjoyment. Such is the depth of engagement that we often forget about our insecurities throughout the process. It doesn’t stop here however, because as we emerge from our state of flow our sense of self is fortified making us more robust than we were before. It is this ability of flow to centre us in the present, detaching us for the stresses of the past or future that truly gives it its potential as a silver bullet for expanding our happiness and optimising our experience of life itself.</p>\n<p>If we imagine our life as a river, we can say that one bank represents boredom or a tendency to inactivity, producing apathy, and the other side representing an overflow of responsibilities, producing anxiety. We often live our lives clinging to one bank or the other, unhappy but feeling fearful of releasing into the unknown. When we have the courage to let go of the bank and ‘go with the flow’, we can find ourselves with a wonderful sense of liberation and the internal question – ‘what was I afraid of?’ This metaphor is illustrative because it shows us that our best approach to having flow in our daily life is by finding the optimal balance between our perceived abilities and the perceived challenge of the tasks at hand - where there is neither boredom (too much ability for the challenge) nor anxiety (too much challenge for our ability).</p>\n<p>By doing this we can generate flow experiences which strengthen our psychological fitness and improve the quality of our relationships. They help your personal growth and self-development, make you more receptive to new experiences, more committed to learning new things. After a flow experience, the concept of the self is generally strengthened because you know that you have overcome challenges with confidence and grace.</p>\n<p>In general terms flow begets flow. We can create more of these experiences in our lives by being aware when we are in them and being open to replicating the experience in other areas of our lives. We can try to focus on our tasks as we perform them without allowing ourselves to be distracted by external thoughts, in this way we can often find we can create a state of flow within this performance, regardless of the nature of the task.\nJournaling can be a useful tool to encourage flow in our lives, by noting when we have flow experiences and the circumstances that inspire them, we can learn to know ourselves, and our flow, that little bit better.</p>\n<p>As we learn to live in the moment more, we can find flow in the small tasks. This in turn allows us to gain more agency over our attention and our intention. These experiences will help us develop greater clarity as to what our lives are about, and redouble our efforts on focussing on what is important to us. Never allow life to cease challenging you, we can always find a way to do things better, to enrich our lives, or those around us. By doing this we can ensure that we are always sufficiently engaged to have flow in our lives. Flow through all aspects of your life, from taking care of your loved ones, to going to the beach, to reading a book; all activities can be done with a high level of engagement, and they can all benefit from this approach.\nStart simple! Have faith in yourself that you know what you are doing. Choose one activity today and fully engage yourself in it. Whether it is making lunch for your kids, or performing a task at work, or arranging to meet with friends; be present, be engaged, and go with the flow! Gradually expand this approach throughout your life and see what a difference it can make!</p>\n<p>I would love to read your tweets about where you find flow in your life!</p>\n","slug":"finding-your-flow","categorySlug":"self-help","summary":"<p>We are wired to experience pleasure when we perform at, or close to, the best of our abilities – peak experience through peak performance. Through giving ourselves the opportunity to perform at our best, we can engender profound changes in our overall wellbeing. Through entering these states of flow <span class=\"summary-ellipsis\">[...]</span></p>"},{"title":"The French Conundrum","description":"Written For Incasso Partners","author":"Rob Power","category":"Economics","date":1453055400000,"image":"notre-dame.jpg","imageCaption":"Photo by Pedro Lastra on Unsplash","html":"<h1 id=\"the-french-conundrum\">The French Conundrum</h1>\n<h2 id=\"socialist-ideals-vs-capitalist-realities\">Socialist Ideals VS Capitalist Realities</h2>\n<p>The world admires France in so many ways. Between Paris and the Riviera are a plethora of attractions that contribute to France being the most popular tourist destination in the world. There is scarcely a chef in the world who doesn’t hold dear the culinary traditions and cuisines of France. You can hardly tie your shoelaces within a mile of the Eiffel Tower without your girlfriend thinking you are about to propose to her! So yes there is much to admire; the charm, the mellifluous accent, the museums, liberty, equality, and fraternity, but alas the economy is not something we can currently add to the list of French strengths.</p>\n<p>First of all it should be noted that the economic outlook doesn’t invoke the same harrowing foreboding as say, Greece, for example. In fact on the face of things a lot of French people are doing OK. They have a relatively high birth rate, usually a contributor to Economic growth. They have a very productive work force; again usually a statistic that would encourage analysts to predicts a growing economy. So why isn’t France flourishing when on the surface there seem to be no shortage of rain and sunshine?</p>\n<p>France hasn’t been doing well for a while now. Since 1990 France’s per capita GDP has been growing slower than all but one other wealthy Nation; Italy, which has far more tangible issues with growth than France does. In fact the country’s manufacturing output is lower today than it was in 1990. So let’s look at some of the reasons it should be doing better. As aforementioned France has a healthy working age population, in fact if you compare France to Germany, Italy, and Spain; it is only France’s that is predicted to steadily increase and are forecasted to overtake Germany around 2045 becoming the largest workforce in the Eurozone. Now consider this, studies have shown that French workers are more productive than their German counterparts. That’s right; the laid back socialist French out-produce their neighbours who are internationally synonymous with efficiency. So there you have it, an abundant and highly productive workforce. </p>\n<h2 id=\"so-where-is-this-great-nation-stumbling\">So where is this great nation stumbling?</h2>\n<p>Well many analysts will point to socialist measures that have been enacted throughout France over the years. For example the 35 hour work week, imposed by the French government in the year 2000. It may be a factor but when we compare the 1,489 hours that the average French worker put in in 2013 to the 1,388 by their German equivalents; it would seem that this is at least not the complete answer. Perhaps a greater contributing factor is France’s unemployment rate which stands at 10.5%, which is more than double Germany’s 4.7%. Additionally there is there labour force participation rate, that is to say the number of working age citizens in or looking for gainful employment, which stands at 71.2% versus Germany’s 77.5%; a considerable difference. Again analysts would point towards some of the social measures put in place as perhaps contributing to this joblessness. It is very difficult to fire people in France so employers are often reasonably quite reluctant to take on new employees. Who could blame them when their employees are protected by a labour code the density of which makes war and peace seem like a pamphlet. Combine this with a vast inefficient public sector and badly designed welfare system and we are starting to get the picture. There are people inside the job market who are comfortable within a nation where, unlike many of its contemporaries, income inequality is not growing. But then there are those on the outside whose chances of being brought in from the cold are demonstrably reduced by the same social measures that protect them if they succeed. A conundrum indeed, but what of the future? Is the investment required to increase employment rates forthcoming?</p>\n<p>Well the French are certainly being proactive about it. Just this week France’s economy Minister, Emmanuel Macron, is visiting the U.S. extolling the virtues of French start-ups and exclaiming his intentions of making France less regimented in its approach to labour regulation. It is a somewhat, unlikely position for a French leftist, as many in French feel that the protections they have achieved for the employed in France to be a great victory of the modern era and they are sure to be noisy about anything they might interpret as a rolling back of such protections. Nevertheless, France is in trouble, growth and jobs are required, and no one is in any doubt of the vast economic potential this much beloved nation represents. Perhaps there is a balance to be struck between Social ideals and corporate requirements, if any nation is likely to find that balance, it is France.</p>\n<h2 id=\"investment-prospects-in-france\">Investment prospects in France</h2>\n<p>While they have been having difficulties growing their GDP, France is still a massively attractive prospect for investors. A steadily growing population combined with the largest tourist figures internationally guarantee myriad opportunities for the investor or entrepreneur in France. Couple this with the loosening up of business practices in recent times and opportunities are beginning to present themselves left, right, and centre. Of course France is a nation built on tradition and cultural business practices are slow to change. With this in mind it is very important for a businessman entering the marketplace to develop an understanding of how people operate in that environment. To this end, it is often advisable to align yourself with an international debt recovery agency whose expertise in multiple jurisdictions will help you ensure your business maintains fiscal liquidity.</p>\n<h3 id=\"need-help-with-international-debt-recovery\">Need help with International Debt Recovery?</h3>\n<p>If your business needs any help recovering debt either in your domestic market or any international market, Incasso Partners provide the complete solution. With their multi-jurisdictional expertise, and “no recovery, no fee” policy, there is no better way to recover the funds owed to you.\nFind out more today by visiting - <a href=\"http://incassopartners.com/\">http://incassopartners.com/</a></p>\n","slug":"the-french-conundrum","categorySlug":"economics","summary":"<p>The world admires France in so many ways. Between Paris and the Riviera are a plethora of attractions that contribute to France being the most popular tourist destination in the world. There is scarcely a chef in the world who doesn’t hold dear the culinary traditions and cuisines of France. You can <span class=\"summary-ellipsis\">[...]</span></p>"},{"title":"Meanwhile, in Waterford","description":"Written for Broadsheet","author":"Rob Power","category":"Opinion","date":1429122600000,"image":"county-pride.jpg","html":"<h1 id=\"meanwhile-in-waterford\">Meanwhile In Waterford</h1>\n<p>This particular piece of cliff face will be familiar to natives of both Waterford and Kilkenny who have, for many years, used it to express pride in their counties. Many a young hurling fan has gotten up at the crack of dawn to stealthily paint it white and blue or yellow and black. Tit for tat friendly jibes at their neighbouring sporting nemesis.</p>\n<p>Of course, there have been times when the tricolour was the daub of choice as the counties were united in support of their country for one reason or another.</p>\n<p>Well last night, a group of similarly stealthy individuals took the time to call for unity once more.</p>\n<p>The upcoming vote is for everyone’s benefit. In as much as I look forward to attending the same sex weddings of my close friends, and wholeheartedly anticipate to a time when our children can express their sexuality casually and without fear of rebuke. I also take this referendum personally.</p>\n<p>The fact that I am not gay won’t mean that I will be unaffected by a no vote. It would be an affront to all of us who have built philosophies around kindness and understanding, all of us who have used thought and empathy to create a moral compass, rather than taking our cues from one book or another.</p>\n<p>Unfortunately a no vote won’t mean a return to the status quo; it will legitimise the woefully outdated thinly veiled homophobia that is rampant throughout our society.</p>\n<blockquote>\n<p>When there is systematic injustice, it gives a certain momentum, a kind of inertia to bigotry and intolerance. This must be removed; we must be proactive to combat this. When our national system doesn’t allow for this sentiment anymore, then I believe it will wither and die in due course, like so many forms of discrimination has done in the past.</p>\n</blockquote>\n<p>Well done those painters! Thanks for the colour! Vote Yes.</p>\n","slug":"meanwhile-in-waterford","categorySlug":"opinion","summary":"<p>This particular piece of cliff face will be familiar to natives of both Waterford and Kilkenny who have, for many years, used it to express pride in their counties. Many a young hurling fan has gotten up at the crack of dawn to stealthily paint it white and blue or yellow and black. Tit for tat frie <span class=\"summary-ellipsis\">[...]</span></p>"}],"post":{"title":"Italy, A Country Divided","description":"Written For Incasso Partners","author":"Rob Power","category":"Economics","date":1463509800000,"image":"colesium.jpg","imageCaption":"Photo by Jace Grandinetti on Unsplash","html":"<h1 id=\"italy--a-country-divided\">Italy – A Country Divided</h1>\n<p>It has been a while since there has been any positive news with regard to the Italian economy. This month, with the release of statistics for the first quarter of 2015, there is finally a glimmer of hope, a tiny green shoot in soil, the fertility of which was beginning to come into question. So after three years of almost continuous recession (having only briefly exited a previous one) Italian GDP grew by a modest 0.3%. This growth is small but given the difficult times that Italy has experienced, even lagging behind the rest of the Eurozone pre-crisis, it still may be cause for optimism. The truth is, however, if we assess Italy’s economy holistically, we can’t fail to see a massive disparity between the northern and southern regions of the nation.</p>\n<h2 id=\"a-world-of-difference\">A World of Difference</h2>\n<p>It is not uncommon for national statistics to gloss over regional inconsistencies but in the case of Italy, these differences are more substantial and it wouldn’t be a stretch to suggest that there are two very distinct economies in play. This divide has its roots in history; even as far back as the unification of Italy in 1861 when economic measures imposed on the south caused an untenable situation for agricultural businessmen, many of whom chose to emigrate in the ensuing decades. Later, when Mussolini was defeated, bringing an end to the fascist period, the allies chose, probably out of necessity, to hand the reigns back to the mafia families, most prevalent in the south. Many commentators point to this enduring widespread corruption as a factor that has been an obstacle to sustained economic development in the area. It is not difficult to understand investors’ reluctance when a 2007 study discovered that an estimated 80% of businesses paid protection money in the Sicilian cities of Catania and Palermo. Causes aside, when we examine modern statistics, the stark differences between the regions are plain to see.</p>\n<p>The economy of Italy as a whole shrank by 0.2% in the period 2001 – 2013. If we look at this regionally we see a much different story, with the North growing by 2% and the South contracting by 7%. This is partially due to the South’s pre-crisis weaknesses, but for the most part; it is the far more catastrophic effects felt in the South post-crisis; which saw the region contract at almost twice the rate of their neighbours to the north. The resultant 13% contraction in the economy, when contrasted to the 7% contraction in the North, gives as clear a picture as any that the odds are stacked against the Mezzogiorno (the southern regions). Due to this disparity, the Italian economy is often both weaker and stronger that the general statistics would lead you to believe, depending on which region you focus on. The differences don’t end here unfortunately; when we examine the number of families living in poverty we see further evidence. In the period 2007 – 2013 the Northern region saw the poverty figure grow from 3.3% to 5.8%. Dismally, the latter figure, 5.8%, was the starting point down south, and it soared to a depressing 12.6% in the same period. The unemployment stats help to round out the picture. Out of the 943’000 Italians that became unemployed between 2007 and 2014; 70% of them were southerners. Of course this situation perpetuates and exacerbates itself through emigration; the young demographic of the Mezzogiorno having no option but to seek greener pastures. So can Italy progress as a whole in the coming years?</p>\n<h2 id=\"can-italy-sustain-growth\">Can Italy Sustain Growth?</h2>\n<p>Italy’s Prime Minister, Matteo Renzi, recently visited the white house and used stereotypically flowery language to describe the trajectory of Italy’s economy saying   Whether or not this is true remains to be seen. Like many of the Eurozone countries, Italy’s recent modest successes are likely to have been supported by external factors. Recent quantitative easing combined with low oil prices are undoubtedly contributory factors. Politically, at least, it seems as though the status quo is beneficial for growth. Renzi has implemented business friendly economic reforms which would point towards an improved climate for investment. There is slow but consistent progress against corruption with government initiatives gradually weakening the grip of organised crime. Political upheavals could have detrimental effects on the economy, however, both at home and abroad. Positively, there seems to be little challenge to the current administration in a time with consistency would be beneficial. Further afield, Italy’s fortunes are connected to Russia as a substantial trading partner. Recent sanctions relating to the Ukrainian issue are not doing them any favours. Greece is another sensitive point. Italy’s close ties with Greece mean that, if they did defect from the Euro, the effects would be felt right across the Apennine Peninsula. </p>\n<h2 id=\"time-to-invest-in-italy\">Time to Invest in Italy?</h2>\n<p>There is no doubt that things are still uncertain in Italy. But with favourable economic legislation and a reduction in organised crime, the pastures are getting more fertile. Businesses are still struggling though and as a new player entering the market it would be prudent to ensure that you don’t let outstanding debts linger too long. With this in mind it is often wise to align yourself with a professional international debt collection agency who can use local experience to recover any debts you are owed anywhere in the country.</p>\n<h3 id=\"need-help-with-international-debt-recovery\">Need help with International Debt Recovery?</h3>\n<p>If your business needs any help recovering debt either in your domestic market or any international market, Incasso Partners provide the complete solution. With their multi-jurisdictional expertise, and “no recovery, no fee” policy, there is no better way to recover the funds owed to you.\nFind out more today by visiting - <a href=\"http://incassopartners.com/\">http://incassopartners.com/</a></p>\n","slug":"italy-a-country-divided","categorySlug":"economics","summary":"<p>It has been a while since there has been any positive news with regard to the Italian economy. This month, with the release of statistics for the first quarter of 2015, there is finally a glimmer of hope, a tiny green shoot in soil, the fertility of which was beginning to come into question. So afte <span class=\"summary-ellipsis\">[...]</span></p>"}},"path":"blog/post/italy-a-country-divided"}
