{"template":"/Users/suryapandian/repo/drona/drona-academy/src/containers/Service","sharedHashesByProp":{},"data":{"detail":{"category":"Video Scripts","entries":[{"video":"https://player.vimeo.com/video/226184927","client":"GoodToGo Media","title":"Promotional Content","__content":"\n\nGoodToGo Media are a content based site that aims to inspire, entertain, and shine a light on what is positive in the world. They sought a concept and script for a video which would illustrate this identity. We chose to contextualise their role as purveyors of positive content, in a world that exposes us to more and more of the negative. We are pleased with the clarity of message in the resulting video.\n"},{"video":"https://player.vimeo.com/video/31140382","client":"Orangina Schweppes Corporation","title":"Corporate Videos","order":1,"__content":"\n\nCorporate video scripts require a particular finesse that differs from consumer targeted promotional materials. It is about representing the company and its ethos in a way that resonates with both prospective employees as well as potential business partners. These kinds of videos must be descriptive of the status quo while also looking to the future, they should pay homage to past achievements while signalling more to come, and they should encapsulate an organisation’s motivation in a way that makes a lasting impression.\n"},{"video":"https://player.vimeo.com/video/153400223","client":"Century Office Supplies","title":"Social Media Videos","order":2,"__content":"\n\nThe script for Century Office Supplies is a great example of the short form promotional videos often use by companies to promote themselves throughout social media platforms. As is often the case for these videos, the challenge as a writer is to provide a concept that is both memorable and catchy, while also allowing for inexpensive production. These taglines and concepts should be repeatable with different visuals, as was the case for this campaign.\n"},{"video":"https://player.vimeo.com/video/193517681","client":"Kailani Ice Tea","title":"Crowdfunding Videos","order":3,"__content":"\n\nThere is a growing trend of small to medium sized enterprises seeking to crowdfund investment in order to expand their business. This provides the particular challenge of finding copy that communicates what is often large amounts of detailed information in a short amount of time. Add to this the need for it to be presented in a way that holds the viewers attention and you have a unique copy-writing challenge. In this example the bulk of our copy was translated to Spanish as Kailani decided to focus on Iberian investors.\n"}],"title":"Question Papers","thumbnail":"exam.jpg","thumbnailInfo":"Photo by Green Chameleon on Unsplash","order":3,"meta":{"title":"Effective scripting for a variety of video styles","description":"Be it corporate videos, consumer campaigns, or short viral clips; we will create a unique and engaging script to represent the essence of your business"},"__content":"\n\nThese days, more and more businesses use video to further their growth. Be it viral videos, crowd funding videos, corporate videos, or indeed advertising campaigns, we have the ability and experience to script them for you at a rate that is highly competitive, we can also recommend partners and provide advice on producing them at a cost that won't break the bank.\n","slug":"video-scripts","html":"<p>These days, more and more businesses use video to further their growth. Be it viral videos, crowd funding videos, corporate videos, or indeed advertising campaigns, we have the ability and experience to script them for you at a rate that is highly competitive, we can also recommend partners and provide advice on producing them at a cost that won&#39;t break the bank.</p>\n","path":"./content/portfolio/video-scripts"}},"path":"services/video-scripts"}
